{
    "title": "THE IEEE GLOBAL INITIATIVE ON ETHICS OF EXTENDED REALITY (XR) REPORT EXTENDED REALITY (XR) ETHICS IN MEDICINE",
    "authors": "Jason Evans; Georgia Livieri; Palak Patel; Monique J Morrow",
    "pub_date": "",
    "abstract": "IEEE believes the information in this publication is accurate as of its publication date; such information is subject to change without notice. IEEE is not responsible for any inadvertent errors. The ideas and proposals in this specification are the respective author's views and do not represent the views of the affiliated organization.",
    "sections": [
        {
            "heading": "EXECUTIVE SUMMARY",
            "text": "Extended Reality (XR) for medical use cases is proving to be beneficial to both patients and healthcare professionals as well as all other stakeholders throughout the healthcare industry. Healthcare is one of the largest industries to adopt XR technology. Some of the XR use-cases include helping surgeons better perform surgeries, immersing patients and healthcare professionals in medical information and education, and training all within XR environments. An ethical framework is required that is evolved from best practices throughout medical and technological fields to help ensure safe and equitable usage of the technology.\nSection 1 introduces XR technology to the reader from a historical timeline perspective. It is assumed that the reader has a general understanding of XR technology including augmented reality (AR), virtual reality (VR), and mixed reality (MR). The virtuality continuum model is presented and definitions for the mixed reality spectrum are introduced.\nSection 2 discusses the background of Medical XR technology. There is significant global adoption of XR technology with strong projections forecasted for the healthcare market. Some of the healthcare stakeholders of XR technology are introduced including expectations and considerations discussed. Section 3 investigates common Medical XR use-cases and provides a brief introduction to the reader indicating how XR technology is applied today. Some of the medical fields discussed include cardiology, neuroscience, and pharmacy. Section 4 discusses the laws, policies, and principles that apply to Medical XR technology Section 5 pertains to key ethical principles of Medical XR technology. This paper contains topics including equitable and sustainable usage of Medical XR technology, design for inclusivity and accessibility, and consent. Telecommunications privacy and security is introduced including topics for remote communications, medical records and data ownership, personal health information (PHI), personal identifiable information (PII), medical privacy and confidentiality, security, and third-party data sharing is discussed. Section 6 identifies key ethical issues, challenges, and risks of Medical XR. Section 7 discusses an ethical approach in terms of XR in Medicine applications. Section 8 concludes the paper. This is an ongoing collaborative effort to evolve concepts and tools introduced in this paper for future versions. Thank you for your interest in the ethics of Medical XR technology.",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "INTRODUCTION",
            "text": "The above quoted statement was generated by an artificial intelligence algorithm (that uses natural learning processing and was trained on medical ethics) while consulting about its ethical considerations regarding using extended reality (XR) technology for medical purposes.\nXR is the next generation of digital computing blending the digital and physical worlds together enabling enduser interaction with intelligent objects powered by artificial intelligence (AI) and machine learning (ML) technologies [1]. XR encompasses all technologies within the virtuality continuum including Augmented Reality (AR), Virtual Reality (VR), Mixed Reality (MR) and everything else that may exist within the continuum [2]. The concept of \"Virtuality Continuum\" and the term Mixed Reality (MR) was first described by Milgram and Kishino in 1994 [3]. Milgram and Kishino described MR as completely connected physical and virtual environments presented within a display which the researchers termed as the virtuality continuum (VC) concept. Microsoft has since revised the VC concept and proposed their own. MR hardware technology extends past Milgram and Kishino original vision of the technology as spatial sound, environmental input including spatial understanding and positional location of the user (X, Y, and Z spatial coordinates) are incorporated in immersive hardware devices [4]. People interact with virtual objects in a MR environment using a combination of gaze, gestures and voice commands and are guided by spatial sound and spatial/ environmental understanding of digital objects overlaid within one's physical environment. Microsoft updated their MR definition to encompass both the physical and digital worlds across the MR spectrum including AR and VR. Stanley G. Weinbaum described in 1935 a fictional model that questions reality for \"magic spectacles\" that exist as goggles that project a story, sight, sound, smell, and taste for the wearer of the device. He went on to describe that \"You are in the story, you speak to the shadows (characters), and they reply, and instead of being on a screen, the story is all about you, and you are in it\" [6]. Antonin Artaud was a French dramatist who may have been the first to define and label the term VR in his book published in 1938 [7]. He related theatre as being a virtual reality, \"la réalité virtuelle\", as characters, objects, and images \"take on the phantasmagoric force of alchemy's visionary internal dramas\" [8]. VR hardware had an early version in 1838 when the first stereoscope that projected a single image by two mirrors was invented. Eventually the stereoscope evolved into the View-Master and was patented in 1938 and \"We can't stop technological progress and so we have to be prepared for the consequences.\" -Nurenyx.AI is available today [9]. The term AR was first introduced by two employees at Boeing Computer Services Research named Tom Caudell and David Mizell in 1990 [10]. They successfully implemented the usage of AR within an industrial setting for wiring instructions for new aircraft being built. Workers would wear head-mounted displays to see overlaid cable positions projected through the eyewear. XR devices available today are powered by AI and ML algorithms, collects biometric data, can integrate Internet-of-Things (IoT) and Internet-of-Medical-Things (IoMT) technology, can connect cross-platform across any device including traditional mobile phones, desktops, tablets, and laptops. Healthcare is one of the top industries that is adopting XR technology.\nOrganizations must be proactive with following an ethical framework to leverage this powerful XR technology that is here to stay. The global COVID-2019 pandemic has accelerated the adoption rate of XR technology by enterprise corporations and now is the time to be as proactive as possible to develop effective ethical policies for companies and developers to adhere to while designing applications that leverage XR.",
            "publication_ref": [
                "b0",
                "b1",
                "b2",
                "b3",
                "b5",
                "b6",
                "b7",
                "b8",
                "b9"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "MEDICAL EXTENDED REALITY BACKGROUND",
            "text": "The rate of global digital health innovation initiatives undertaken by governments and industry accelerated during the COVID-19 pandemic. The global digital health market is growing for the period 2020-2027 at a CAGR of 33.4% and is expected to continue after the COVID-19 pandemic ends. The CAGR rate prior to the COVID-19 pandemic for the digital health market was 9% for the period 2019-2026. There has been increasing adoption rates of digital health technology to collect real-time data [11]. The global XR market has an expected $393B\nUSD market by 2025 with a CAGR of 69.4% [12]. Seventy-five percent of the global population and most smartphone owners will be frequent AR users by 2025 and 5G technology will accelerate AR adoption [13].",
            "publication_ref": [
                "b10",
                "b11",
                "b12"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "DEFINITION",
            "text": "Computing has influenced medicine tremendously, however desktop and mobile devices are difficult or impossible to use in certain clinical practice areas such as sterile operating room environments [14].\nComprehending three-dimensional (3D) information on a 2D screen is challenging such as reading data provided from medical instruments regarding patient anatomy. Healthcare represents the second largest group of early adopters for XR technology [15]. ",
            "publication_ref": [
                "b13",
                "b14"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "EXPECTATIONS",
            "text": "End-users expect an immersive and compelling user experience (UX) while interacting with XR technology within safe and secure environments where data is protected and will not be shared with others. Some of these compelling XR user experience expectations include photorealistic quality assets and a believable listener soundscape that builds upon real-world knowledge [16]. The UX of the XR experience can be measured based on subjective (i.e., standard questionnaires), behavioral (i.e., amplitude of movement, direction of gaze), and objective (i.e., time logging, bio signals) measures [17]. HCPs plus other stakeholders within the supply chain also have distinct expectations of XR technology as a digital health tool.",
            "publication_ref": [
                "b15",
                "b16"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "CONSIDERATIONS",
            "text": "XR technology evaluation best practices in medicine are needed to help ensure safety, privacy, and security for all stakeholders who interact in environments that include digital medical data [18]. A thorough technology assessment bridges research and development throughout the evolution as a medical application [19]. Common key values (such as autonomy, justice, beneficence, and nonmaleficence) for medical ethics can be leveraged as frameworks for assessing XR technology [20].",
            "publication_ref": [
                "b17",
                "b18",
                "b19"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "APPLICATIONS OF MEDICAL EXTENDED REALITY USE CASES",
            "text": "The ability of XR to overlay virtual content or environment in the physical environment has captured attention from experts, researchers, and innovators from various fields. In healthcare, XR has disrupted and transformed the way how healthcare providers and medical students are trained on a variety of content ranging from teaching foundational subjects to preparing or simulating complex surgical procedures [21], [22], [23], [24], [25].\nAlthough XR technologies have been exploited mostly for aeronautical, military and education purposes, there is tremendous effort and research invested to develop medical applications to guide diagnosis, pre-operative simulations, surgeries, and treatment. In this paper, some of the medical fields that have seen testing and adoption of XR tools/devices are reviewed. Though this is not a comprehensive review of the XR-based medical applications, it highlights current research and innovations in this field.",
            "publication_ref": [
                "b20",
                "b21",
                "b22",
                "b23",
                "b24"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "CARDIOLOGY",
            "text": "High quality three-dimensional visualization of heart anatomy in XR is the most utilized and one of the simplest medical applications that is used for educational/training as well as pre-operative planning. Numerous XR-based medical applications have been developed as patient education and pre-operative procedure simulation of cardiology procedures. However, several medical devices/applications are utilizing XR to support and help patients and healthcare providers in various disease management and treatment procedures. In a pilot trial, researchers showed that task-specific VR training provides significant added benefit to patients recovering from chronic stroke [26]. Based on these findings, Mindmaze developed MindMotionPRO and MindMotion Go, two medical-grade XR tools designed specifically to support and promote active and rigorous rehabilitation. In addition, clinicians and researchers are using standalone tools like The Body VR to 3D construct radiologic imaging data (from CT, MRI and PET scans) during pre-procedural planning of patients with cardiovascular diseases [27]. Healthcare providers are increasingly adopting XR-based tools (e.g., EchoPixel) to perform virtual run-throughs of routine and complex procedures to better prepare for the actual procedure [28]. In cardiology, XR applications are constantly being developed and tested for intraprocedural use-cases [29], [30]. One major limitation of these newly developed tools is the lack of thorough validation. As XR medical applications mature and evolve, much needed validation of their use-case and feasibility in current healthcare settings will be available in near future.\nAuthorized licensed use limited to: Kennesaw State University. Downloaded on October 13,2025 at 18:38:13 UTC from IEEE Xplore. Restrictions apply.",
            "publication_ref": [
                "b25",
                "b26",
                "b27",
                "b28",
                "b29"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "NEUROSCIENCE",
            "text": "Similarly in neuroscience, XR is extensively explored and tested by researchers as it holds high potential for its ability in providing behavioral modifications. Virtual reality exposure therapy (VRET) is gaining a lot of attention and support for treating specific phobias. In VRET, patients are exposed to a virtual/simulated environment resembling their real-life fear or phobias. In a large meta-analysis, which included 14 clinical trial studies, patients who received VRET showed a significant behavioral change and were better able to handle their fears compared to patients who did not receive VRET [31]. In addition, XR-based platforms are increasingly being used for neuropsychological assessments as well as assessing efficacy and/or response from ongoing therapies such as for cancer [32]. For patients suffering from neurological disorders, clinicians are integrating real-time information from biosensors, clinical data, radiological images, and stimulation data into XR to get a more comprehensive view of the patient condition and the process [34]. Although XR provides great technological breakthroughs in treating neurologic diseases, there are several concerns/limitations associated with them. Due to the high use of simulations and virtual environments, users develop cybersickness in which they experience motion sickness, eye strain, fatigue, headache, and nausea [35]. In some cases, patients using XR medical application develop symptoms related to dissociative disorders [36].",
            "publication_ref": [
                "b30",
                "b31",
                "b33",
                "b34",
                "b35"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "PHARMACY",
            "text": "Enhanced education offering in the fields of cardiology, neuroscience and many other disciplines including pharmacy is exhaustively being exploited. There are other applications in the development that show various useful areas where XR can make an impact. XR has potential to revolutionize patient self-care by motivating healthier lifestyle choices. For instance, an increasing number of pharmacists are now helping patients quit smoking through virtual reality mindful exposure therapy (VR-MET). The VR-MET approach is based on the published research where patients learn and cope with their cravings through virtually simulated environment [37]. Similar XR applications are also being developed to help patients identify and avoid alcohol misuse [38].\nSome additional XR pharmacy applications include reducing anxiety due to trypanophobia experienced during blood draws, and immunizations in both adults [39] and children. Like other applications, XR use for pharmacy applications have not been fully tested and validated and is further being developed for more generalized and broader use.",
            "publication_ref": [
                "b36",
                "b37",
                "b38"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "LAWS, POLICIES, AND PRINCIPLES THAT APPLY TO MEDICAL EXTENDED REALITY",
            "text": "Extended reality technologies are becoming more and more affordable and accessible as time progresses.\nMultiple manufacturers have entered the market with affordable hardware, accelerating the research and development efforts by researchers, innovators, and healthcare providers. Several medical use-cases such as pain management, rehabilitation, and phobia treatment [31] for XR have been proposed, many of them in later stages of development. Though XR brings advantages and improved medical tools to our healthcare systems, recently discovered health concerns that are associated with its use need to be addressed. Patients who used XR for medical purposes, experienced cyber sickness [35] and/or developed symptoms related to dissociative disorders [36]. In rare cases, patients suffering from psychosis experienced a psychiatric episode triggered from the extended use of XR [41]. The safety and effectiveness of XR medical applications should be thoroughly tested in a typical clinical trial setting. There is a lack of regulatory gap in the field of XR, and therefore one should be very cautious about using or prescribing XR-based tools/applications until they are rigorously tested and approved by a federal health agency [42]. Current laws and policies in place for internet of medical devices or other digital tools or drugs can be extended to XR. In this paper, some of the important guidelines or laws that need to be considered before using XR for medical purposes are discussed.\nFrom the recent implementation of telemedicine in current health practice, there are few direct things that need to be considered from legal and regulatory issues. In a recent meta-analysis, researchers reviewed 68 published works from literature to evaluate legal, ethical, and regulatory concerns raised by other researchers and clinician scientists [43]. Concerns involving consent, confidentiality, privacy, the doctor-patient relationship, data security, responsibility, record keeping, licensure, continuity of care, quality of care, image quality, concordance, phone stewardship and patient satisfaction were identified in this extensive review of proposed guidelines [43].\nThere is little to no proposed framework to tackle these issues available in literature and many of these concerns are currently being addressed by FDA in the form of clinical guidelines [42].\nFreedom of thought and mental integrity is one of the most important ethical issue for XR as these emerging technologies can exert behavioral modifications and change patients attitudes through persuasion. In other words, XR tends to change what the user is thinking of or his/her own beliefs. Therefore, the use and even sale of XR applications and associated hardware should be strictly regulated like other medical devices. The authenticity of information delivered over XR is another potential concern. It is the healthcare professional's duty to inform patients with correct information regarding the disease condition, available diagnostic/therapeutic options, and any side-effects or symptoms from a prescribed treatment or a drug. This holds true for XR medical applications, and it should be the healthcare professional's responsibility to provide this information to patients. Also, Medical XR applications should only be prescribed to patients by a licensed healthcare practitioner. This paper does not take a stand on how freedom of thought is defined, but merely states the potentially dangerous implications of XR technology if used in a corrupt way.\nInstead of devising new guidelines for XR-based healthcare tools, the guidelines that were originally proposed for telemedicine are also relevant to XR and therefore their practice should be extended to XR. Specifically, guidelines proposed by American College of Physicians and American Medical Association address the majority of the previously listed concerns regarding XR and therefore should be extended to XR medical applications [45], [46]. These guidelines form a good basis for practicing the use of XR-based tools; however, they may not address all known and future concerns and therefore should be routinely updated and revised.",
            "publication_ref": [
                "b30",
                "b34",
                "b35",
                "b40",
                "b41",
                "b42",
                "b42",
                "b41",
                "b45",
                "b46"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "KEY ETHICAL PRINCIPLES FOR USE OF MEDICAL EXTENDED REALITY",
            "text": "Advances in computing and displays have enabled a recent surge in low-cost, mixed-reality devices, including AR and VR, which have resulted in substantial interest in the development of medical extended reality (MXR) devices. Clinical researchers and medical device developers have started to make use of this technology for critical surgery, diagnostics, and therapeutics. Despite all the previous mentioned, the evaluation of MXR devices has been significantly delayed, causing inefficiency, and increased regulatory burden in ensuring the safety and effectiveness of MXR applications and in identifying acceptable claims due to the pace of the development.\nFor all the above reasons, it is of high priority to consider the urgent unanswered ethical questions regarding user data practices including collection, management, and exploitation within these ecosystems, given that the integrated sensory enhancements (and embedded or implanted devices) can become dangerous. All in all, a great advantage of VR is that this type of \"reality\" can be controlled, so patients learn to deal with challenges in a stepwise manner [47]. Meanwhile, the use of VR in clinical research and treatment creates new forms of human-technology interaction in medicine with substantial ethical tensions [48], particularly regarding vulnerable patients. Doubtlessly, emerging virtual reality systems offer intriguing therapeutic possibilities, but their development and use should be guided by ethical priorities that account for the specific vulnerabilities of patients [47], including the core bioethical principles of respect for autonomy, beneficence, non-maleficence, and justice.",
            "publication_ref": [
                "b47",
                "b48",
                "b47"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "EQUITABLE AND SUSTAINABLE MEDICAL EXTENDED REALITY TECHNOLOGY",
            "text": "Augmented Reality/Virtual Reality (AR/VR) is still a developing technology and new opportunities for its use in equity and inclusion efforts are progressively emerging as the underlying technology improves and a more diverse set of users experience it for the first time. To be more specific, the following three areas of opportunity for AR/VR play a significant role in supporting broader equity and inclusion efforts: 1) leveraging its potential as an empathy tool and adapting its extensive capabilities to meet the needs of users with disabilities, 2) mitigating barriers that arise from physical distance to strengthen communities, and 3) enhancing person-to-person interactions across locations [49].\nAR/VR-immersive technologies that enable users to experience digitally rendered content in both physical and virtual space-have the potential to transform the way individuals work, learn, and interact [50]. By mitigating barriers imposed by physical distance, they can bolster economic opportunity by allowing employees to collaborate from anywhere in the world, make critical services such as healthcare more accessible, creating new channels for social connections, and finally their ability to manipulate elements of partially or fully virtual spaces allow them to more easily accommodate a diverse set of user needs, from accessibility features to privacy preferences [50].\nAll in all, immersive technologies have the potential on the one hand to make both digital and non-digital services and spaces more inclusive and equitable; whereas, on the on other hand, industry leaders and policymakers will come up with great challenges to maximize the availability of immersive technologies across a wide range of demographics and to mitigate potential unintended consequences. Particularly, they should take into serious consideration the following:\n1) Privacy, health, and safety risks that could adversely affect AR/VR users and non-users.\n2) Financial, physical, technical, and societal barriers different user groups face when adopting or using AR/VR devices and applications.\n3) Bias and discrimination risks in critical areas such as healthcare services [50].\nFocus on the previous considerations will benefit many users by reducing the potential for malicious use of the technology or other unintended consequences that could impede progress in AR/VR adoption [50].",
            "publication_ref": [
                "b49",
                "b50",
                "b50",
                "b50",
                "b50"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "DESIGN FOR INCLUSIVITY AND ACCESSIBILITY",
            "text": "To address challenges, those in charge of designing and implementing the technology will need to delve into the perspectives and lived experiences of a diverse array of individuals. If they hope to ensure AR/VR advances inclusiveness and equity, they should pay attention to voices from vulnerable, marginalized, or otherwise underserved individuals and underrepresented communities in discussions around both policy and product development [50].\nIterative design is a key principle of HCI (human-computer interaction), wherein usability considerations are incorporated from the start of the design process, meaning that systems are periodically tested with users as part of the development process, resulting in iterative improvements to the design and usability until the system is ready to deploy to end-users [51]. Unfortunately, in practice, fixes for usability concerns perceived as affecting small populations (such as people with disabilities) are often tacked on at the end of the software design lifecycle, resulting in sub-par user experiences [52]. However, considering accessibility as a core part of a system's iterative design process is valuable for all users, since everyone experiences situational disabilities dependent on their context (e.g., a person holding groceries is unable to use their arms for other tasks, a person in a loud room may have difficulty hearing.) [53].\nVirtual Reality (VR) technologies are at a key crossroads in their development, with costs and form-factors placing them just at the cusp of widespread commercial feasibility, hence accessibility has not thus far been a consideration in the development of mainstream VR systems [51]. However, the following five key areas of accessibility for the VR community needs to be considered: the accessibility of VR content, the accessibility of interaction techniques, device/hardware accessibility, inclusive user representations within VR environments, and accessibility-focused application areas for VR [51]. The VR community should seize this moment in time (while devices and standards are still evolving) to include accessibility considerations in VR systems that will create a more usable and inclusive technological future for users of all abilities [51].",
            "publication_ref": [
                "b50",
                "b51",
                "b52",
                "b53",
                "b51",
                "b51",
                "b51"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "CONSENT INTO MEDICAL EXTENDED REALITY APPS",
            "text": "The informed consent is a defining moment that should allow patients to understand their condition, what procedure they are undergoing, and what consequences may follow. This process should foster trust and promote confidence, without increasing patients' anxiety. New immersive 3D imaging technologies may serve as a tool to facilitate this endeavor [54].\nAuthorized licensed use limited to: Kennesaw State University. Downloaded on October 13,2025 at 18:38:13 UTC from IEEE Xplore. Restrictions apply.\nInformed consent (IC) is defined as \"the process of communication between a patient and physician that results in the patient's authorization or agreement to undergo a specific medical intervention\" [55]. A valid IC requires the patient's full understanding of the proposed intervention, including potential risks, benefits, and alternatives [56]. The patient's decision must be independent, free-willed, and considered valid solely once the therapeutic procedure (along with all the possible management alternatives), the expected benefits, and the possible risks have been comprehended. Currently, the information disclosed is often either too superficial or filled with overwhelming technical information, making it arduous for patients to truly take in [57], [58].\nCommunication skills are pivotal to this process. The use of traditional paper-based consent forms may generate difficulties for doctors to express themselves appropriately, as they limit the dialogue to the mere reading of the document. New technologies may improve the delivery of health information by providing a more informal environment in which the patient can see the case in a three-dimensional (3D) reality and have the chance to ask and discuss these images with the doctor who may feel more at ease and comfortable in answering all questions and thoroughly explaining the case [59].",
            "publication_ref": [
                "b54",
                "b55",
                "b56",
                "b57",
                "b58",
                "b59"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "TELECOMMUNICATIONS PRIVACY/SECURITY",
            "text": "A high-level description of issues related to telecommunications in privacy and security for XR applications in medicine are provided in 5.4.1 through 5.4.7.",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "TELEMEDICINE/REMOTE COMMUNICATIONS",
            "text": "Remote communication in an XR environment is beneficial for healthcare and medicine as it eliminates unnecessary travel and affords a much richer end-user experience in an immersive environment where patient education and medical information can be provided more efficiently. XR technologies potentially can enhance telehealth with improved accessibility, engagement, and presence [60].",
            "publication_ref": [
                "b60"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "MEDICAL RECORDS AND DATA OWNERSHIP",
            "text": "Medical records are important to the interest of patients for insurance, employment, current health care and future needs, and other purposes [61]. The answer to the question as to who owns patient-generated health data is not that simple since many different stakeholders are involved throughout the health data cycle. A society-generated design approach is needed. The complexity and distribution of data rights and responsibilities often leads to conflicts as people expect that their data is kept private in fears of any public disclosure could lead to discrimination [62].\nAuthorized licensed use limited to: Kennesaw State University. Downloaded on October 13,2025 at 18:38:13 UTC from IEEE Xplore. Restrictions apply.",
            "publication_ref": [
                "b61",
                "b62"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "PERSONAL HEALTH INFORMATION (PHI)",
            "text": "Personal health information is as follows:\n Personal Health Information Protection Act (PHIPA) \n",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": " Eye tracking",
            "text": " Human pose estimation/ body mechanics",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "MEDICAL PRIVACY AND CONFIDENTIALITY",
            "text": "Biometric data generated by users in XR is difficult to anonymize as indicated by a study that collected 95 data points where researchers were able to identify end-users with an accuracy rate of 90% [63]. Patients need to trust that their protected information will be shared in confidence and are entitled to decide whether to disclose their PHI. Patients are afforded this level of confidentiality with their personal information in life and after death [64]. Physicians are responsible for protecting patient privacy rights and have a confidentiality duty resulting from the patient-physician relationship [65].",
            "publication_ref": [
                "b63",
                "b64",
                "b65"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "SECURITY",
            "text": "The value of a healthcare technology product is enhanced when privacy and security protections are built into the app to ensure that collected information is secured and that the usage of data will only be used and disclosed as approved or expected by the user. Regional laws for health data protections such as HIPAA Privacy, Security, and Breach notification rules are sometimes required for health apps [66].",
            "publication_ref": [
                "b66"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "THIRD-PARTY DATA SHARING",
            "text": "There are many important reasons why data is shared in the medical industry. Medical providers do not work in isolation and depend on shared data from other medical providers to ensure that patients receive the best possible treatment. Sharing data with other medical providers ensures that the best possible research is being done as more information will be available to help guide medical treatment decisions. People are more willing to share health data with third-party commercial companies for patient purposes as opposed to business purposes. Patient comfort levels increase when privacy concerns are acknowledged, and education occurs around how the health data privacy will be protected. If the patient-centered benefits of partnerships with healthcare systems and third-party commercial companies are realized, then the comfort of the patient and the public are increased. People aged 45-59 are less comfortable with the sharing of their health data with third party companies than individuals aged 18-29 based on a US public survey conducted with 1841 participants [67]. Information that is disclosed to third-party commercial companies without consent may negatively impact the patient-physician relationship integrity, trust is undermined, and principles of confidentiality and informed consent are violated [68]. It is estimated that 79% of healthcare apps share or resell data and no regulations exist that require patient approval of this later data usage [69].\nAuthorized licensed use limited to: Kennesaw State University. Downloaded on October 13,2025 at 18:38:13 UTC from IEEE Xplore. Restrictions apply.",
            "publication_ref": [
                "b67",
                "b68",
                "b69"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "KEY ETHICAL ISSUES, CHALLENGES, AND RISKS OF MEDICAL EXTENDED REALITY",
            "text": "",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "ETHICAL ISSUES OF MEDICAL XR",
            "text": "When research programs that allow patients to enter a VR environment are established, then appropriate safeguards to protect patients not only from potential adverse effects derived from the experience, but also from being exploited by career ambitious medical researchers, should be considered. The process requires external review: institutional review boards and ethics of research committees will necessarily become familiar with the potential hazards of VR experiences and be able to reach an informed view on the potential risks to vulnerable patients of the VR experience [70]. This practically means that patients who are mentally impaired and/or physically disabled are not capable of making an informed decision about virtual reality environments and based on their curiosity and excitement on the technology, this may further obscure their judgment.\nIn advance, medical centers, where the creation of virtual reality environments is necessary, must respond to the challenge of the technology. Before patients are exposed to VR environments, those centers should establish standards of \"clinical safety\" [70], because there is the possibility that VR systems may unintentionally introduce errors or distortions, due to programming errors, causing mental distress to a patient. In case of dependent patients whose quality of life is much reduced by chronic illness or disability, the VR environment may be preferable than reality.\nWhat is more, introducing patients to VR environments raises fundamental ethical issues concerning free will, the nature of interpersonal relationships, and how the consequences of our interpersonal behavior is understood [70]. What are the consequences for the individual itself in case the VR environment is populated by simulated characters drawn from real life-sketches with no free will and predetermined behavior? Does a VR environment support egocentric, self-serving patterns of behavior, which are close to critical modification by the action of others?\nFinally, personal data privacy is the most critical and important issue that needs to be addressed immediately as data collection and its use by the third parties can get easily exploited and used for malicious reasons [71].\nAuthorized licensed use limited to: Kennesaw State University. Downloaded on October 13,2025 at 18:38:13 UTC from IEEE Xplore. Restrictions apply. ",
            "publication_ref": [
                "b70",
                "b70",
                "b70",
                "b71"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "REGULATORY SCIENCE GAPS AND CHALLENGES OF MEDICAL XR",
            "text": "",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "RISKS OF MEDICAL XR",
            "text": "The use of XR in healthcare is associated with several risks that should be addressed before it is routine use in healthcare [73]. Some of the key risks are listed follows:\n The immersive and potentially persuasive nature of XR technology may impact how people interact with the technology or the environment or data featured in it. Additionally, it may even influence how people see each other or themselves in the XR environment.\n Privacy and security of one's personal and health information [74].\n XR's \"feel-like-real\" environment and simulations has high potential for distracting users from the \"true reality\" [75], [77].\n In the past, XR users have reported some symptoms or side-effects such as feeling dizzy or disoriented and nausea from excessive use [76].\n There is also high risk of accidents or injury as user may get disoriented due to XR's immersive and vivid environment.",
            "publication_ref": [
                "b73",
                "b74",
                "b75",
                "b77",
                "b76"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "RECOMMENDATIONS",
            "text": "Recommendation #1",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "R&D and validation framework for XR-based tools and models",
            "text": "Development of a framework that provides recommendations and guidelines for designing, testing, and supporting XR-based tools and models in health care [78].",
            "publication_ref": [
                "b78"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Recommendation #2",
            "text": "Comprehensive review of the XR landscape in healthcare\nConduct extensive review of the use of XR in healthcare and the organizations driving and innovating in the field to better understand the size of market and potential future growth sectors [78].",
            "publication_ref": [
                "b78"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Recommendation #3",
            "text": "",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Establish Centers of Excellence (CoE)",
            "text": "Centers of Excellence will regulate and oversee the following key aspects regarding the use of XR in healthcare: 1) Ensure the design and validation of robust XR tools for use,\n2) Simplify distribution and purchasing channels for healthcare providers and organizations, and 3) Ensure equal accessibility to XR enabled devices for healthcare providers and other users [78].",
            "publication_ref": [
                "b78"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Recommendation #4",
            "text": "",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Connect the XR and Healthcare Community",
            "text": "To promote and encourage collaborations and networking between XR technology developers (i.e., engineers, XR designers, artists, researchers) and adopters (i.e., healthcare providers, educators, technology experts), a consortium or network is required, accelerating product development, and pushing the XR imaginative boundaries/capabilities [78].",
            "publication_ref": [
                "b78"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Recommendation #5",
            "text": "",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Partnerships",
            "text": "Partnerships between academia, healthcare workers, and XR device manufacturers are critical to ensure the timely maturation of this emerging technology [78].\nAuthorized licensed use limited to: Kennesaw State University. Downloaded on October 13,2025 at 18:38:13 UTC from IEEE Xplore. Restrictions apply.",
            "publication_ref": [
                "b78"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Recommendation #6",
            "text": "",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Adoption of Guidelines",
            "text": "Adopt and further equip current proposed guidelines by American College of Physicians [79] and American Medical Associations for Medical XR [80] and implement those guidelines for wider general medical use.",
            "publication_ref": [
                "b79",
                "b80"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Recommendation #7 Testing and Validation Framework",
            "text": "Bring a framework for testing and validating XR-based medical tools/devices, so all the tools that are used for medical purposes are passed through a rigorous testing like the clinical trials.",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Recommendation #8",
            "text": "",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Transparent Data Collection",
            "text": "Data collection and usability should be completely transparent as XR devices are quite powerful and do have the ability to collect various user data. There is an urgent need for data collection and government policies relating to Medical XR.",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Recommendation #9 Medical XR Ethics Framework",
            "text": "A Medical XR ethics framework is needed that will address key concerns and provide questions for exploration through an ethical lens for rights/responsibilities, results, relationships, and reputation.",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Recommendation #10",
            "text": "",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "Medical XR Ethics Decision Making Model",
            "text": "A Medical XR ethics decision-making model will provide a decisioning roadmap for key collaborators including stakeholders and other decision makers to input context/facts into the design of technology that will go through an evaluation process including negotiation.\nAuthorized licensed use limited to: Kennesaw State University. Downloaded on October 13,2025 at 18:38:13 UTC from IEEE Xplore. Restrictions apply.",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "BUILDING AN ETHICAL APPROACH FOR MEDICAL EXTENDED REALITY",
            "text": "XR technology is beneficial to society. Not only does it help economic growth by improving medical care and using XR for various training purposes, but it can also be used to improve or enhance certain lives. On one hand, medical professionals can use XR technology to improve the care they give their patients by simulating certain conditions and developing a better understanding of how to treat those conditions. XR technology can also be used to train and educate medical professionals so that they can provide better care than ever before. This applies not only to the education process but also as a way of improving doctor-patient interactions. XR allows a person to experience things that would otherwise be impossible. It's not hard to imagine how XR technology could augment existing medical procedures for more patient comfort or even allow doctors to perform surgery remotely via telepresence robot. XR is a highly immersive experience that can be used to manipulate people's senses, thoughts, and emotions. What makes XR appealing is the possibility to interact with a seemingly realistic world, and this raises moral questions regarding its use. Is it okay for doctors to practice surgery in XR? Should people suffering from chronic pain be permitted to experience pleasant sensations via XR?\nIt seems like XR is here to stay. It can't be predicted how it will change human civilization, but it seems almost certain that the world will never be quite the same. Let's first look at the related concepts of ethics and grounded theory. The purpose of medical ethics is to provide a framework for making ethical decisions in medicine. That is, some sort of an approach is needed that can help humans make moral judgments regarding right and wrong actions, and it should be based on the philosophical considerations that lie behind medical practice. Ethics is an applied branch of philosophy that analyzes the practice of clinical medicine and related scientific research.\nMedical ethics can be considered as a system of moral principles that guides decisions regarding right or wrong conduct in medical institutions, engineering practices, research methodologies, among other fields. Grounded theory is a type of inductive analysis made famous by the work of Barney Glaser and Anselm Strauss in 1967 [81]. It was designed to generate an understanding of human activities, especially during the process of social interaction. The method is rooted within qualitative research. In grounded theory, one starts with the observation of a phenomenon and makes connections between events based on data from real-life situations.\nIn fact, grounded theory is considered an inductive method, in contrast with deductive methods such as logical positivism. Now, let's look at the concept of \"ethics\" and its application in medicine. Medical ethics is based on a set of values that professionals can refer to when making decisions in any case where there might be confusion or conflict about how one should act. The core principle of medical ethics is the respect for human autonomy [82].\nAutonomy refers to a person's ability to make decisions or choices that affect life without interference from others.",
            "publication_ref": [
                "b81",
                "b82"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "CONCLUSIONS",
            "text": "Recent advances in software and hardware supporting XR led to the development of numerous medical applications where XR-based tools and services are making a significant impact in improving patient lives and disease management. Thus, XR technologies are benefiting patients, healthcare providers and researchers, making them more robust, convenient, and attractive tools for healthcare. Cardiovascular, neuroscience, pharmacy, telehealth, and surgical procedures are the biggest fields where XR is integrated for providing smoother, reliable, and more efficient medical care. In this paper, some of the recent advancements and highlights in XR development have been reviewed, and there are many other disciplines of healthcare where XR technologies are making a significant impact. Although the majority of the Medical XR applications are still under development, many of them need further validation before making them available for general use. Recently XRrelated health concerns such as cybersickness have been reported in patients who are using XR applications. The following issues need to be addressed as well as patient privacy and its ethical use should be addressed immediately.\n Misuse and/or abuse of personal data  Unregulated XR may lead to unfavorable outcomes  XR is embedded into companies' decision making, processes, and products  Algorithms change and adapt over time.\nAuthorized licensed use limited to: Kennesaw State University. Downloaded on October 13,2025 at 18:38:13 UTC from IEEE Xplore. Restrictions apply.",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "RAISING THE WORLD'S STANDARDS",
            "text": "3 Park Avenue, New York, NY 10016-5997 USA http://standards.ieee.org Tel.+1732-981-0060 Fax+1732-562-1571",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        }
    ],
    "references": [
        {
            "ref_id": "b0",
            "title": "Mixed reality brings real benefits to enterprises",
            "journal": "Accenture",
            "year": "2016",
            "authors": " Accenture"
        },
        {
            "ref_id": "b1",
            "title": "Extended Reality",
            "journal": "",
            "year": "2018-01-08",
            "authors": " Qualcomm"
        },
        {
            "ref_id": "b2",
            "title": "A Taxonomy of Mixed Reality Displays",
            "journal": "IEICE Transactions on Information Systems",
            "year": "1994-12",
            "authors": "P Milgram; F Kishino"
        },
        {
            "ref_id": "b3",
            "title": "Mixed Reality",
            "journal": "",
            "year": "2017-11-09",
            "authors": " Microsoft"
        },
        {
            "ref_id": "b4",
            "title": "What is Mixed Reality?",
            "journal": "",
            "year": "2021-07-01",
            "authors": " Microsoft"
        },
        {
            "ref_id": "b5",
            "title": "Pygmalion's Spectacles",
            "journal": "Continental Publications",
            "year": "1935",
            "authors": "G S Weinbaum"
        },
        {
            "ref_id": "b6",
            "title": "Le Theatre et son Double",
            "journal": "Gallimard",
            "year": "1938",
            "authors": "A Artaud"
        },
        {
            "ref_id": "b7",
            "title": "Antonin Artaud Describes 'La Réalité Virtuelle",
            "journal": "",
            "year": "2021-09",
            "authors": "J Norman"
        },
        {
            "ref_id": "b8",
            "title": "History of Virtual Reality",
            "journal": "",
            "year": "2021-09-02",
            "authors": "The Franklin; Institute "
        },
        {
            "ref_id": "b9",
            "title": "The History of Virtual and Augmented Reality",
            "journal": "",
            "year": "2021-09-02",
            "authors": "P Mealy"
        },
        {
            "ref_id": "b10",
            "title": "Global Digital Health Market to Surpass $1,045.8 Million",
            "journal": "",
            "year": "2021-04-13",
            "authors": "Research Dive"
        },
        {
            "ref_id": "b11",
            "title": "Extended Reality (XR) Market Size to Reach USD 393 Billion by 2025 at 69.4% CAGRReport by Market Research Future (MRFR)",
            "journal": "",
            "year": "2021-08-09",
            "authors": ""
        },
        {
            "ref_id": "b12",
            "title": "Snap Consumer AR Global Report 2021",
            "journal": "Deloitte Digital",
            "year": "2021",
            "authors": "Snap Inc"
        },
        {
            "ref_id": "b13",
            "title": "Extended Reality in Medical Practice",
            "journal": "Curr Treat Options Cardiovasc Med",
            "year": "2020",
            "authors": "C Andrews; M K Southworth; J N Silva; J R Silva"
        },
        {
            "ref_id": "b14",
            "title": "XR Technology Survey: Key Stakeholders Optimistic About Mass Adoption",
            "journal": "",
            "year": "2019-03-26",
            "authors": " Arpost"
        },
        {
            "ref_id": "b15",
            "title": "User Experience Guidelines for Designing HMD Extended Reality Applications",
            "journal": "Human-Computer InteractionINTERACT",
            "year": "2019",
            "authors": "S Vi; T Silva Da Silva; F Maurer"
        },
        {
            "ref_id": "b16",
            "title": "Evaluating User Experiences in Mixed Reality",
            "journal": "",
            "year": "2021",
            "authors": "D Alexandrovsky; S Putze; V Schwind"
        },
        {
            "ref_id": "b17",
            "title": "Medical extended-reality public workshop at FDA: towards best evaluation practices for virtual and augmented reality in medicine",
            "journal": "",
            "year": "2019-09-11",
            "authors": " Fda"
        },
        {
            "ref_id": "b18",
            "title": "Institute of Medicine (US) Committee for Evaluating Medical Technologies in Clinical Use",
            "journal": "National Academies Press",
            "year": "1985",
            "authors": ""
        },
        {
            "ref_id": "b19",
            "title": "What Is Medical Ethics, Why Is It Important?",
            "journal": "",
            "year": "2021-09-03",
            "authors": " Medscape"
        },
        {
            "ref_id": "b20",
            "title": "Extended Reality in Medical Practice",
            "journal": "",
            "year": "2019",
            "authors": "C Andrews; M K Southworth; J N A Silva; J R Silva"
        },
        {
            "ref_id": "b21",
            "title": "The effectiveness of virtual reality-based technology on anatomy teaching: A meta-analysis of randomized controlled studies",
            "journal": "BMC Med. Educ",
            "year": "2020",
            "authors": "J Zhao; X Xu; H Jiang; Y Ding"
        },
        {
            "ref_id": "b22",
            "title": "Virtual Reality-Based Simulators for Cranial Tumor Surgery: A Systematic Review",
            "journal": "World Neurosurg",
            "year": "2018",
            "authors": "T Mazur; T R Mansour; L Mugge; A Medhkour"
        },
        {
            "ref_id": "b23",
            "title": "Current state of virtual reality simulation in robotic surgery training: a review",
            "journal": "Surg. Endosc",
            "year": "2016",
            "authors": "J D Bric; D C Lumbard; M J Frelich; J C Gould"
        },
        {
            "ref_id": "b24",
            "title": "Virtual and augmented reality for surgical training and simulation in knee arthroplasty",
            "journal": "Arch. Orthop. Trauma Surg",
            "year": "2021-07",
            "authors": "G S Goh; R Lohre; J Parvizi; D P Goel"
        },
        {
            "ref_id": "b25",
            "title": "Increasing upper limb training intensity in chronic stroke using embodied virtual reality: a pilot study",
            "journal": "J. Neuroeng. Rehabil",
            "year": "2017",
            "authors": "D Perez-Marcos"
        },
        {
            "ref_id": "b26",
            "title": "Role of virtual reality in congenital heart disease",
            "journal": "Congenit. Heart Dis",
            "year": "2018-05",
            "authors": "C S Ong"
        },
        {
            "ref_id": "b27",
            "title": "Current and Future Applications of Virtual, Augmented, and Mixed Reality in Cardiothoracic Surgery",
            "journal": "Ann. Thorac. Surg",
            "year": "2020-12",
            "authors": "A H Sadeghi"
        },
        {
            "ref_id": "b28",
            "title": "Improved accuracy using mixed reality visualization and interaction during transcatheter ablation procedures",
            "journal": "Circulation",
            "year": "2018",
            "authors": "J N Silva; M Southworth; A Dalal; G F Van Hare; J R Silva"
        },
        {
            "ref_id": "b29",
            "title": "Improving Visualization and Interaction During Transcatheter Ablation Using an Augmented Reality System: First-in-Human Experience",
            "journal": "Circulation",
            "year": "2018",
            "authors": "J N Silva; M Southworth; A Dalal; G F Van Hare; J R Silva"
        },
        {
            "ref_id": "b30",
            "title": "Can virtual reality exposure therapy gains be generalized to real-life? A meta-analysis of studies applying behavioral assessments",
            "journal": "Behav. Res. Ther",
            "year": "2015-11",
            "authors": "N Morina; H Ijntema; K Meyerbröker; P M G Emmelkamp"
        },
        {
            "ref_id": "b31",
            "title": "Applications of technology in neuropsychological assessment",
            "journal": "Clin. Neuropsychol",
            "year": "2013",
            "authors": "C M Parsey; M Schmitter-Edgecombe"
        },
        {
            "ref_id": "b32",
            "title": "Virtual Reality in Health System: Beyond Entertainment. A Mini-Review on the Efficacy of VR During Cancer Treatment",
            "journal": "J. Cell. Physiol",
            "year": "2016-02",
            "authors": "A Chirico; F Lucidi; M De Laurentiis; C Milanese; A Napoli; A Giordano"
        },
        {
            "ref_id": "b33",
            "title": "Interacting with Presence: HCI and the Sense of Presence in Computer-mediated Environments",
            "journal": "DE GRUYTER OPEN",
            "year": "2014",
            "authors": "G Riva; J Waterworth; D Murray"
        },
        {
            "ref_id": "b34",
            "title": "A Systematic Review of Cybersickness",
            "journal": "",
            "year": "2014",
            "authors": "S Davis; K Nesbitt; E Nalivaiko"
        },
        {
            "ref_id": "b35",
            "title": "Virtual reality induces dissociation and lowers sense of presence in objective reality",
            "journal": "Cyberpsychol. Behav. Soc. Netw",
            "year": "2016",
            "authors": "F Aardema; K O'connor; S Côté; A Taillon"
        },
        {
            "ref_id": "b36",
            "title": "Validation of smoking-related virtual environments for cue exposure therapy",
            "journal": "Addict. Behav",
            "year": "2012-06",
            "authors": "O García-Rodríguez; I Pericot-Valverde; J Gutiérrez-Maldonado; M Ferrer-García; R Secades;  Villa"
        },
        {
            "ref_id": "b37",
            "title": "Applications of virtual reality in individuals with alcohol misuse: A systematic review",
            "journal": "Addict. Behav",
            "year": "2018",
            "authors": "A Ghiţă; J Gutiérrez-Maldonado"
        },
        {
            "ref_id": "b38",
            "title": "Is Virtual Reality Ready for Prime Time in the Medical Space? A Randomized Control Trial of Pediatric Virtual Reality for Acute Procedural Pain Management",
            "journal": "J. Pediatr. Psychol",
            "year": "2018",
            "authors": "J I Gold; N E Mahrer"
        },
        {
            "ref_id": "b39",
            "title": "Virtual reality for pain and anxiety management in children",
            "journal": "Can. Fam. Physician",
            "year": "2017-12",
            "authors": "K Arane; A Behboudi; R D Goldman"
        },
        {
            "ref_id": "b40",
            "title": "Public Perceptions Regarding Use of Virtual Reality in Health Care: A Social Media Content Analysis Using Facebook",
            "journal": "J. Med Internet Res",
            "year": "2017",
            "authors": "M S Keller; H J Park; M E Cunningham; J E Fouladian; M Chen; B M R Spiegel"
        },
        {
            "ref_id": "b41",
            "title": "Medical Extended Reality Program: Research on Medical Extended Reality-Based Medical Devices",
            "journal": "",
            "year": "2021-09",
            "authors": "F C ; D ; R "
        },
        {
            "ref_id": "b42",
            "title": "Selfie TelemedicineWhat Are the Legal and Regulatory Issues?",
            "journal": "Stud. Health Technol. Inform",
            "year": "2018",
            "authors": "M Mars; C Morris; R E Scott"
        },
        {
            "ref_id": "b43",
            "title": "Authorized licensed use limited to: Kennesaw State University. Downloaded on October 13,2025 at 18:38:13 UTC from IEEE Xplore. Restrictions apply. Copyright © 2022 IEEE",
            "journal": "",
            "year": "",
            "authors": ""
        },
        {
            "ref_id": "b44",
            "title": "The Persuasive Power of Virtual Reality: Effects of Simulated Human Distress on Attitudes towards Fire Safety",
            "journal": "",
            "year": "2010",
            "authors": "L Chittaro; N Zangrando"
        },
        {
            "ref_id": "b45",
            "title": "Ethical practice in Telehealth and Telemedicine",
            "journal": "J. Gen. Intern. Med",
            "year": "2017-10",
            "authors": ""
        },
        {
            "ref_id": "b46",
            "title": "Policy recommendations to guide the use of telemedicine in primary care settings: an American College of Physicians position paper",
            "journal": "Ann. Intern. Med",
            "year": "2015-11",
            "authors": ""
        },
        {
            "ref_id": "b47",
            "title": "Ethical tensions of virtual reality treatment in vulnerable patients",
            "journal": "Nature Medicine",
            "year": "2019",
            "authors": "P Kellmeyer; N Biller-Andorno; G Meynen"
        },
        {
            "ref_id": "b48",
            "title": "Neurophilosophical and Ethical Aspects of Virtual Reality Therapy in Neurology and Psychiatry",
            "journal": "Cambridge Quarterly of Healthcare Ethics",
            "year": "2018",
            "authors": "P Kellmeyer"
        },
        {
            "ref_id": "b49",
            "title": "Current and Potential Uses of AR/ VR for Equity and Inclusion",
            "journal": "",
            "year": "2021",
            "authors": "B Y E Dick"
        },
        {
            "ref_id": "b50",
            "title": "Risks and Challenges for Inclusive and Equitable Immersive Experiences",
            "journal": "",
            "year": "",
            "authors": "B Y E Dick"
        },
        {
            "ref_id": "b51",
            "title": "Accessible by design: An opportunity for virtual reality",
            "journal": "",
            "year": "2019",
            "authors": "M Mott; E Cutrell; F M Gonzalez; C Holz; E Ofek; R Stoakley; M M Ringel"
        },
        {
            "ref_id": "b52",
            "title": "Ability-based design",
            "journal": "Communications of the ACM",
            "year": "2018",
            "authors": "J O Wobbrock; K Z Gajos; S K Kane; G C Vanderheiden"
        },
        {
            "ref_id": "b53",
            "title": "When computers fade: Pervasive computing and situationally induced impairments and disabilities",
            "journal": "",
            "year": "2003",
            "authors": "A Sears; M Lin; J Jacko; Y Xiao"
        },
        {
            "ref_id": "b54",
            "title": "Informed consent through 3D virtual reality: a randomized clinical trial",
            "journal": "Acta Neurochirurgica",
            "year": "2021",
            "authors": "A Perin; T F Galbiati; R Ayadi; E Gambatesa; E F Orena; N I Riker; H Silberberg; D Sgubin; T R Meling; F Dimeco"
        },
        {
            "ref_id": "b55",
            "title": "Informed Consent",
            "journal": "American Medical Association",
            "year": "2019",
            "authors": ""
        },
        {
            "ref_id": "b56",
            "title": "Reconceptualizing the informed consent process at eight innovative hospitals",
            "journal": "Joint Commission Journal on Quality and Patient Safety / Joint Commission Resources",
            "year": "2008",
            "authors": "J Matiasek; M K Wynia"
        },
        {
            "ref_id": "b57",
            "title": "How doctors and patients discuss routine clinical decisions: Informed decision making in the outpatient setting",
            "journal": "",
            "year": "1997",
            "authors": "C H Braddock; S D Fihn; W Levinson; A R Jonsen; R A Pearlman"
        },
        {
            "ref_id": "b58",
            "title": "Patient-centered informed consent in surgical practice",
            "journal": "",
            "year": "2006",
            "authors": "J L Bernat; L M Peterson"
        },
        {
            "ref_id": "b59",
            "title": "Digital multimedia: A new approach for informed consent?",
            "journal": "JAMAJournal of the American Medical Association",
            "year": "2015",
            "authors": "A R Tait; T Voepel-Lewis"
        },
        {
            "ref_id": "b60",
            "title": "Extended Reality for Enhanced Telehealth During and Beyond COVID-19: Viewpoint",
            "journal": "JMIR Serious Games",
            "year": "2021",
            "authors": "T Ong; H Wilczewski; S R Paige"
        },
        {
            "ref_id": "b61",
            "title": "Code of Medical Ethics: Privacy, confidentiality & medical records",
            "journal": "American Medical Association",
            "year": "2021-09-05",
            "authors": ""
        },
        {
            "ref_id": "b62",
            "title": "Who owns patient data? The answer is not that simple",
            "journal": "",
            "year": "2020-08",
            "authors": "A Bourke; G Bourke"
        },
        {
            "ref_id": "b63",
            "title": "Task-Driven Biometric Authentication of Users in Virtual Reality (VR) Environments",
            "journal": "",
            "year": "2018",
            "authors": "A Kupin; B Moeller; Y Jiang; N K Banerjee; S Banerjee"
        },
        {
            "ref_id": "b64",
            "title": "Code of Medical Ethics Opinion 3.2.1",
            "journal": "American Medical Association",
            "year": "2021-09-05",
            "authors": ""
        },
        {
            "ref_id": "b65",
            "title": "Principles for the Protection of Patient Privacy",
            "journal": "Canadian Medical Association",
            "year": "2018",
            "authors": ""
        },
        {
            "ref_id": "b66",
            "title": "Resources for Mobile Health Apps Developers",
            "journal": "US Department of Health & Human Services",
            "year": "2021-09-01",
            "authors": ""
        },
        {
            "ref_id": "b67",
            "title": "The public's comfort with sharing health data with third-party commercial companies",
            "journal": "Humanities and Social Sciences Communications",
            "year": "2020",
            "authors": ""
        },
        {
            "ref_id": "b68",
            "title": "Access to Medical Records by Data Collection Companies",
            "journal": "American Medical Association",
            "year": "2021-09-05",
            "authors": ""
        },
        {
            "ref_id": "b69",
            "title": "Data sharing practices of medicines related apps and the mobile ecosystem: traffic, content, and network analysis",
            "journal": "BMJ",
            "year": "2019",
            "authors": "Q Grundy; K Chiu; F Held"
        },
        {
            "ref_id": "b70",
            "title": "Ethical issues in the application of virtual reality to medicine",
            "journal": "Computers in Biology and Medicine",
            "year": "1995",
            "authors": "L J Whalley"
        },
        {
            "ref_id": "b71",
            "title": "The Ethics of Realism in Virtual and Augmented Reality",
            "journal": "Frontiers in Virtual Reality",
            "year": "2020",
            "authors": "M Slater; C Gonzalez-Liencres; P Haggard; C Vinkers; R Gregory-Clarke; S Jelley; Z Watson; G Breen; R Schwarz; W Steptoe; D Szostak; S Hanlan; D Fox; J Silver"
        },
        {
            "ref_id": "b72",
            "title": "Medical Extended Reality Program: Research on Medical Extended Reality-Based Medical Devices",
            "journal": "",
            "year": "2021",
            "authors": " Fda"
        },
        {
            "ref_id": "b73",
            "title": "Extended Realities and Regulation",
            "journal": "",
            "year": "2021",
            "authors": "E Sheiman"
        },
        {
            "ref_id": "b74",
            "title": "The digitization of healthcare: Boundary risks, emotion, and consumer willingness to disclose personal health information",
            "journal": "Information Systems Research",
            "year": "2011",
            "authors": "C L Anderson; R Agarwal"
        },
        {
            "ref_id": "b75",
            "title": "Reality Check: The regulatory landscape for virtual and augmented reality",
            "journal": "",
            "year": "2016",
            "authors": "A Hobson"
        },
        {
            "ref_id": "b76",
            "title": "Virtual and Augmented Reality Applications in Medicine and Surgery The Fantastic Voyage is here",
            "journal": "Anatomy & Physiology: Current Research",
            "year": "2019",
            "authors": "M Wayne; J Ryan; S Stephen"
        },
        {
            "ref_id": "b77",
            "title": "Challenges and Practical Considerations in Applying Virtual Reality in Medical Education and Treatment",
            "journal": "Oman Medical Journal",
            "year": "2020",
            "authors": "T Baniasadi; S M Ayyoubzadeh; N Mohammadzadeh"
        },
        {
            "ref_id": "b78",
            "title": "The Growing Value of XR in Healthcare in the United Kingdom",
            "journal": "",
            "year": "2021-09-12",
            "authors": "F Kilkelly; R O'brien; S Ticho"
        },
        {
            "ref_id": "b79",
            "title": "Ethical practice in telehealth and telemedicine",
            "journal": "J. Gen. Intern. Med",
            "year": "2017",
            "authors": "D Chaet; R Clearfield; J E Sabin; K Skimming"
        },
        {
            "ref_id": "b80",
            "title": "Lesbian, gay, bisexual, and transgender health disparities: Executive summary of a policy position paper from the American College of Physicians",
            "journal": "Ann. Intern. Med",
            "year": "2015",
            "authors": "H Daniel; R Butkus"
        },
        {
            "ref_id": "b81",
            "title": "The Discovery of Grounded Theory: Strategies for Qualitative Research",
            "journal": "Aldine de Gruyter",
            "year": "1967",
            "authors": "B G Glaser; A L Strauss"
        },
        {
            "ref_id": "b82",
            "title": "The value of autonomy in medical ethics",
            "journal": "Med Health Care Philos",
            "year": "2006-12-09",
            "authors": "J Varelius"
        }
    ],
    "figures": [
        {
            "figure_label": "",
            "figure_type": "figure",
            "figure_id": "fig_0",
            "figure_caption": "Health Insurance Portability and Accountability Act (HIPAA) Eighteen identifiers of personal health information:  Names  Dates, except year  Telephone numbers  Geographic data  FAX numbers  Social Security numbers  Email addresses  Medical record numbers  Account numbers  Health plan beneficiary numbers  Certificate/license numbers  Vehicle identifiers and serial numbers including license plates  Web URLs  Device identifiers and serial numbers  Internet protocol addresses  Full face photos and comparable images  Biometric identifiers (i.e., retinal scan, fingerprints)  Any unique identifying number or code 5.4.4. PERSONAL IDENTIFIABLE INFORMATION (PII) Personal identifiable information is as follows:  Zip/postal codes, IP addresses, voiceprints, VR and AR tracking data  Personal nature of collected data  Biometric data such as retina or iris scans  Fingerprints and handprints  Face geometry  Finger tracking Authorized licensed use limited to: Kennesaw State University. Downloaded on October 13,2025 at 18:38:13 UTC from IEEE Xplore. Restrictions apply.",
            "figure_data": ""
        },
        {
            "figure_label": "",
            "figure_type": "table",
            "figure_id": "tab_1",
            "figure_caption": "Some of the most significant regulatory science gaps and challenges that drive the Medical Extended Reality technologies are the following according to the Medical Extended Reality Program in the FDA's Center for Devices and Radiological Health (CDRH), which conducts regulatory science research to help ensure patient access to innovative extended reality-based devices that are safe and effective[72]: \"1) A wide variety of MXR platforms that lack characterization and evaluation methods for different important medical applications such as interventional procedures and surgery or rehabilitation, 2) Consumer-grade sensors, such as accelerometers, inertial measurement units, and cameras used by MXR platforms that have not been validated for the clinical contexts of use, 3) Few or no assessment tools for usability of the device, such as cognitive load, which affect device safety and effectiveness in surgical and diagnostic applications. The Medical Extended Reality Program is intended to fill these knowledge gaps by addressing open research questions related to the design, development, and evaluation of novel MXR devices and related applications. The outcomes of this program will provide the scientific foundation in support of regulatory requirements and decisions on innovative MXR devices.\"",
            "figure_data": ""
        }
    ],
    "formulas": [
        {
            "formula_id": "formula_0",
            "formula_text": "",
            "formula_coordinates": [
                17.0,
                72.0,
                149.22,
                4.98,
                10.6
            ]
        }
    ],
    "doi": ""
}