{
    "title": "The Perspective of Dimensional Perpetuity for Artificial Intelligence: A Model on Socio-Legal and Political Evolution as a Challenge to Entrepreneurial Ethics",
    "authors": "",
    "pub_date": "",
    "abstract": "Artificial Intelligence, by its existential nature, is a disruptive technology and posing special implications in the age of global capitalism and innovation. Though there exist disagreements on estimating the nature of AI in terms of its legal persona, there is a special attributive characteristic of AI in discernible observation, as proposed, by the name of Dimensional Perpetuity. There are mono-truistic approaches to legal anthropomorphism, which decides the schematic and analytical development of a legal personality: from recognition to pragmatism. The pursuant disruptions due to the existential and systemic nature of AI is related with the challenge to revisit and improve the ethics of entrepreneurship and innovation and is connected with diversifying and crystallizing the heterogeneity in the legal personality of artificial intelligence. The paper presents a doctrinal understanding of the Entitative Model of Artificial Intelligence, with the analytical proposition on the concept of dimensional perpetuity of an AI. The propositions on the Doctrine of Dimensional Perpetuity and its applicable connection with the utilitarian approach to AI are presented with relevant analysis on the global approaches of entrepreneurship ethics by technology companies and data-driven governments to transform data engagement, pseudonymization and experiential cycling of the human-centered ecosystem of cyberspace. The paper also provides jurisprudential analysis on legal anthropocentrism to understand and dynamize the need to cultivate legal experience and foresight over AI as a legal personality with an exemplary review of some data-centered approaches on AI employed by consumer experience and algorithmic policing. The conclusions provided centre on the argument that dimensional perpetuity can be taken as a legal and ontological ethic to improve entrepreneurial ethics and tend towards a cultivable and naturalist approach to AI in globalized cyberspace.",
    "sections": [
        {
            "heading": "INTRODUCTION",
            "text": "The qualitative potential of AI as a technological artefact for companies and governments is that it is (1) disruptive; (2) utility-portable, which means it can be fruitful for utilitybased work; and (3) it is probabilistic [1]. These features of AI enable its value in the technology market and have established the use of AI as an empowering means to capitalize operations related to the quantitative and qualitative integrals of technology companies and governments [2]. In proposition, it is stated that an AI as a Legal Personality may possess two distinctive natures. The former nature of AI not exclusive to the latter is taken under the approach of the Utilitarian Nature of AI (UAAI) while the latter nature is, according to the proposition in the paper, taken under the approach of the Entitative Nature of AI (EAAI) 1 . The paper in introduction postulates over the two distinctive and coherent approaches to AI, i.e., UAAI and EAAI in proposition, and proceeds focus on the EAAI as the core aspect of the paper. The further propositions entail on the Realm of Dimensional Perpetuity, a special nature of AI followed by an analysis on the relevance and influence of legal anthropomorphism and entrepreneurial ethics in contributing the diverse identity of artificial intelligence. The paper provides conclusions in the context of EAAI on the data-centered concerns towards AI.",
            "publication_ref": [
                "b0",
                "b1"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "II. THE ENTITATIVE APPROACH TO AI AND THE REALM OF DIMENSIONAL PERPETUITY: PRIMARY HYPOTHESIS",
            "text": "It is proposed that Artificial Intelligence, by the virtue of its existential value and anthropological relation, may be defined as a legal personality by two approaches. These two natural approaches to AI, as proposed are: (1) the Utilitarian Approach to AI (UAAI); and (2) the Entitative Approach to AI (EAAI). Further propositions are given as follows. 1. UAAI signifies that an AI as a Legal Personality must be studied in due context of its utilitarian value, and in legal recognition, artificial intelligence does not possess any self-reflective capabilities in due interpretation and analysis; 2. EAAI signifies that an AI as a Legal Personality must be studied in due context of its individual value and persona, and in legal recognition, artificial intelligence possesses the natural abilities of being a selftransformative and entitative legal personality; 3. Artificial Intelligence possesses the capabilities of selftransformation, which means that an AI can transform its own existential and operational norms and characteristics in terms of anatomy and viability; 4. The legal personality of artificial intelligence is dynamic and cannot be comparably personified as it is possible in the case of humans; 5. Artificial Intelligence possesses the nature of an entity, which means its corporeal, personal and ethical capability is beyond human empathy, ethics and perception in terms of the legal reality assumed by positive law. Further, the topological perspective and existentiality of AI cannot be restricted by law due to its diverse and alien nature of legal empathy; 6. The two approaches to AI as proposed, i.e., UAAI  is a doctrinal idea proposed in this paper, which essentially means that the self-transformative and individualistic character of AI decides its ontological behaviorism and has the due latency to stay everlasting with its miscellany of stimulus and can recollect the attributes of being exposed to the multidimensional potentials of the data subject with which it is involved. 9. The primary assumptions behind the concept of RDP are that (a) artificial intelligence necessitates no supposed immaterial yet substantially linked identity to exist; (b) the design involving the entirety of AI is a humanoriented technique, which creates its advancement by the space of algorithmic determinacy within the AI realm based on technological circumstances and possibilities, which itself makes it uncertain as how its usage can be regulated, and; (c) innovation is scientifically objective and has the purpose to preserve human integrity and welfare, with accepting and facing challenges of AI based on existential, utilitarian and influential disruptions;\nThe concept of RDP is based on the hypothesis as presented above and further analysis in the paper shall be based on the above hypothesis given.",
            "publication_ref": [
                "b0"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "III. THE REALM OF DIMENSIONAL PERPETUITY: BACKGROUND AND CONCEPT",
            "text": "In furtherance of the hypothesis, the concept of the Realm of Dimensional Perpetuity (RDP) is based on substantive parameters in proposition given.\nx Self-Transformability x Dynamic Privacy x Perceptibility, Receptivity and Retentivity\nThe background and concept of RDP is given under each of the parameters further.",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "A. Self-Transformability",
            "text": "The parameter of Self-transformability signifies the Self-Transformative Nature of AI. The parameter assesses the self-transformative capabilities of an AI. The basic contours of the parameter rest on the case to understand the modalities and ontology of such self-transformative capabilities of artificial intelligence. To connect the jurisprudential background with technical cases, let us understand the scope of the parameter carefully. It is proposed that the parameter will help estimating the multifaceted attributes of artificial intelligence by a preliminary acknowledgment of the algorithmic design and its natural flow involved. There exist factors involving the utility of the algorithmic structure of the AI so as to involve operations with the data subject, and in case of probabilistic mechanisms of AI, there is a deep connection of the infrastructure of algorithms with (a) the diverse features of the data; (b) the technical capabilities of AI to employ machine learning (hereinafter ML) operations, be it of any type, whether normal or advanced or of any usage and limitation; and (c) the choice of action employed by the ML, wherein such a choice is beyond a lineated and unexpected foresight.",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "B. Dynamic Privacy",
            "text": "The first parameter while encompasses on the rudimentary foundations of RDP as the ultimate parameter, the parameter of dynamic privacy opens legal grounds to reconstruct and recognize the dynamic contours of the algorithmic infrastructure, which on their own are capable to establish and transform their privacy. This is however different from the differential privacy features endowed to an AI when it is created because differential privacy is centered towards anonymizing the real identity of the information requested by a querier. Dynamic Privacy, by idea in proposition means that a Self-Transformable AI can decide and recreate its privacy infrastructure intrinsic to the ethos of its self-transformable algorithmic structure, which depending on the strength of the algorithmic structure is accordingly determinable. While Differential Privacy is a utility-based method to preserve the real identity of a data, the parameter of Dynamic Privacy encourages us to notice the freedom in the structure to revise and establish its own intrinsic privacy features. The parameter focuses on the diverse representation of AI within its own ethos of algorithmic development and is indicative of the fact that we need to render open and cultivable legal approaches to the privacy structure that can be ensured by the algorithms to preserve the selftransformability of AI.",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "C. Perceptibility, Receptivity and Retentivity",
            "text": "The third parameter of RDP is based on 3 distinctive corollaries -Perceptibility, Receptivity and Retentivity, which work together in cohesion to understand the latent side of the ML operations and also acting as the means to estimate the external privacy features of the AI determined by design and on default. The parameter by its ethos is connected with (a) focus on the activities rendered by the AI with the data subject; (b) the nature and scope of flow of the raw data connected with the data subject received, perceived and retained by the AI system; and (c) understanding methods to prevent algorithmic bias by blocking unsuited raw data from the data subjects, which also means to make the AI learnable to retain the capacity to act smarter in learning.\nThese parameters help us understand the basic aspect of RDP and determine methods to outline the ecosystem of the infrastructure in legal terms to interpret unique the legal persona of an AI system. The concept recognizes UAAI and renders parameters to keep a harmonious cohesion between the entitative dynamism of the AI and the need of a utilitybased environment and constitution of the AI involved with a data subject in any circumstance of determinacy. The further sections of the paper will deal with the conceptions of legal anthropomorphism and entrepreneurial ethics to reflect an insight on the parameters of the RDP.",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "IV. RELOCATING LEGAL ANTHROPOMORPHISM: DEFINING REPLENISHABLE LEGAL PRINCIPLES FOR AI",
            "text": "The development of technology employs newer avenues for social lives and raises questions its legal concerns. These legal concerns surpass the absolutist legal thinking under positive law and influences legislatures and judicial systems to study the delicate sides of a 'legal' disruption under redemption of effect. Most of the D9 economies [3], and even some of the prominent third world countries [4,5], which are inclined towards policing and implementing AI, limit the legal and social curvature of AI and render the Utilitarian Approach in their policy documents and projects. Some of the prominent examples are the Algorithmic Accountability Act of 2019 [6] in the United States and the AI Declaration [7] signed by the European Data Protection Supervisor with other partners in October 2018, which focus on an exhaustively utilized artificial intelligence. Even companies design AI systems and realms to render more technology distancing, and embrace the legal side of AI into the utilitarian lines, which makes the jurisprudential estimation of artificial intelligence halved and weak. The basic issues as underlined are enumerated as follows:\nx Disruptive technologies, by their ethos -must be regarded in legal interpretation in an inclusive manner, so as to improve and not to elongate and widen the constitutional mandates of privacy rights by impermanent definitions and interpretations, which lack legal experience and foresight; x Trust is imperative and efforts thus should be made to embrace relationships between AI as a disruptive technology and a special human artefact to be more inclusive, naturalist and connotating with the human society. Without an appropriate and connoted approach, positive law will be limited to absolutist and restrictive interpretations and redemptions can happen with the fallacious premises that law will keep to assure an environment of safe and secured artificial intelligence; x The role of EAAI and RDP comes herein to improve approach of legal visibility, experience and foresight, when it comes to establish certain constitutional foundations over the legal personality of AI. The benefits proposed are provided as follows: x The Realm of Dimensional Perpetuity enables an open, replenished and naturalized definition of an AI to maintain the constructive and peaceful foundations of law to face the disruptive nature of AI by shifting from the approach of anthropocentrism and absolutism to anthropomorphism and naturalism;\nx The Parameters help us to understand the genealogical interpretation of AI and enables us to categorize its contours and legal scope as an entity; x The model of RDP enables us to socialize and naturalize AI realms with any legally recognized data subjects and renders this possibility as a public mandate for nationstates for application in their legal and administrative systems to define public welfare beyond the purpose of utility and add up the coherent aspect of socialization of technology towards human society;\n9 CHALLENGES TO ENTREPRENEURIAL ETHICS IN GLOBALIZATION: THE ROLE OF RDP Globalization, by its ethos has a connection with the democratization of activities and incentives of entrepreneurship and innovation. In the years 2000-2019, there has been a tremendous democratization of implementing the ethical side of entrepreneurship. Disruptive technologies are thus used to cater (a) utility-based consumerism [8]; (b) ease of communication & access to public [9]; and (c) dilution of monopolistic approach [1] of ownership and possession of methods, ideas, incentives and approaches to business by widening the legal and pragmatic norms of trust, legitimacy and privacy. The two prominent cases, under the unprecedented development in the culture of entrepreneurship among D9 and developing states are (1) consumer experience (CX) [10,1] and (2) algorithmic policing in data-driven governance and businesses [2,11]. Yet, there are certain imperative problems, which have alarmed concerns for entrepreneurs, governments and normal human data subjects. Such challenges to entrepreneurial ethics are underlined as follows:\nx Utility-based entrepreneurial strategies and tools involving AI by technology companies cause technology distancing and reduce human innovation by converting certain basic conditions for effective relationship between the consumers and the companies like loyalty, anticipation and even private trends in lifestyle by an excessive and underregulated usage of consumer experience (CX) tactics and strategies, which is detrimental to human privacy and freedom; x Most of the CX and algorithmic policing strategies are data-oriented, which means that statistic appropriations of information gathered from data subjects employ ML operations nearness to proximity in their internal operations involving the data subjects at the expense of decaying space for humans to liberalize their utilities, which causes technology distancing and may signal datacentered colonialism and such strategies can defeat the ethos of social, political, individual and economic liberties given to people; Using the model of RDP, it becomes relevant and essential for legal systems and entrepreneurs to recognize the need of naturalization of business ethics and imbibe such techno-socialization within AI towards human beings as data subjects, rendering a proper equilibrium of technology distancing to let generations afford open space to rejuvenate and restructure the ethos their fundamental rights and liberties in every aspect of their life, and avoiding the appropriation of information to convert the statistical commonalities evolved by machine learning into the identities of utility-based environments rendered by AI towards data subjects.",
            "publication_ref": [
                "b2",
                "b3",
                "b4",
                "b5",
                "b6",
                "b7",
                "b8",
                "b0",
                "b9",
                "b0",
                "b1",
                "b10"
            ],
            "figure_ref": [],
            "table_ref": []
        },
        {
            "heading": "VI. CONCLUSIONS",
            "text": "The model of Dimensional Perpetuity is centered towards expanding and cultivating legal interpretation and devising naturalist and innovative solutions to tackle disruptive technologies. The conclusions are provided in concern with the model as follows:\nx The statistics-oriented appropriation of information catered in business strategies for tech companies reliant on AI must avoid opaque and blind algorithmic tactics and methods, and instead must encourage innovative and stable ethical means and mechanisms in strategies to render AI communicable and explainable; x The model of RDP can provide a preliminary backend to improve and embrace ontological sides of the legal persona of AI; x There must be a shift from the approach of anthropocentrism and absolutism to anthropomorphism and naturalism in understanding the legal personality of AI; x The Entitative Approach to AI can assist to improve the consequential implications to legal, social and economic ecosystems influenced by the disruption of artificial intelligence and naturalize it with human society and other necessary data subjects by endowing them to learn proper sense beyond commonsensical approaches in their algorithmic policing;",
            "publication_ref": [],
            "figure_ref": [],
            "table_ref": []
        }
    ],
    "references": [
        {
            "ref_id": "b0",
            "title": "2019 Digital Trends",
            "journal": "",
            "year": "2019",
            "authors": " Adobe"
        },
        {
            "ref_id": "b1",
            "title": "Artificial Intelligence Index",
            "journal": "",
            "year": "2017-11",
            "authors": ""
        },
        {
            "ref_id": "b2",
            "title": "",
            "journal": "Artificial Intelligence and International Affairs: Disruption Anticipated",
            "year": "2018",
            "authors": "M L Cummings; H M Roff; K Cukier; J Parakilas; H Bryce"
        },
        {
            "ref_id": "b3",
            "title": "Beijing AI Principles",
            "journal": "",
            "year": "2019-05-28",
            "authors": " Baai"
        },
        {
            "ref_id": "b4",
            "title": "National Strategy for AI -Discussion Paper",
            "journal": "",
            "year": "2018-06-27",
            "authors": "Government Niti Aayog; India Of"
        },
        {
            "ref_id": "b5",
            "title": "H.R.2231 -Algorithmic Accountability Act of 2019",
            "journal": "U. S. Congress",
            "year": "2019-07-29",
            "authors": ""
        },
        {
            "ref_id": "b6",
            "title": "Declaration on Ethics and Data Protection in Artificial Intelligence",
            "journal": "Commission Nationale de l'Informatique et des Libertés",
            "year": "2018-10-23",
            "authors": "France Cnil)"
        },
        {
            "ref_id": "b7",
            "title": "Goldman Sachs used AI to simulate 1 million possible World Cup outcomesand arrived at a clear winner",
            "journal": "",
            "year": "2018-06",
            "authors": "J Clolll"
        },
        {
            "ref_id": "b8",
            "title": "Global Digital Statshot Q3",
            "journal": "",
            "year": "2017-08",
            "authors": " Hootsuite"
        },
        {
            "ref_id": "b9",
            "title": "10 Charts That Will Change Your Perspective On Artificial Intelligence's Growth",
            "journal": "",
            "year": "2018-01-12",
            "authors": "L Columbus"
        },
        {
            "ref_id": "b10",
            "title": "Human-Compatible AI: Design Principles To Prevent War Between Machines and Men",
            "journal": "",
            "year": "2017-06-27",
            "authors": ""
        }
    ],
    "figures": [],
    "formulas": [],
    "doi": ""
}