{
  "title": "Computer Science Ethics Education in Australia -A Work in Progress",
  "sections": [
    {
      "title": "Abstract",
      "content": "There are several ethical concerns related to AI around issues such as fairness, bias privacy, discrimination and sustainability. In this work-in-progress paper, we examine whether undergraduates are being adequately prepared to navigate these issues. We explored the ethics curricula of 12 Australian universities' Computer Science courses, observing that most courses focus on micro-ethical concepts such as professionalism and compliance with professional and industry standards. The lack of explicit macro-ethical agendas for the betterment of society and the planet invites further work on the differences between espoused and realized curricula, the efficacy of delivery modes, and the adequacy of curricular offerings."
    },
    {
      "title": "INTRODUCTION",
      "content": "Advances in the 'Fourth Industrial Revolution' brought about by new technologies 'are merging the physical, digital and biological world in ways that create huge promise and potential peril' . Ethical issues relating to new technologies are gaining prominence, particularly as Artificial Intelligence (AI)-infused technologies are beginning to proliferate in many aspects of everyday life, including how we communicate with, value, and relate with each other. The use of AI to influence voter preferences, the rise of deep fakes, and other emerging AI applications are creating enormous challenges for policy and governance. At the same time, AI technologies hold tremendous potential for contributing significantly to the economy as well as improving the quality of life. Australia's innovation strategy for the next decade outlines the importance of AI, stating that 'a suite of new digital technologies, such as machine learning, optimization, artificial intelligence, sensing, robotics, visualization and distributed ledgers, are opening new opportunities for innovation' . Reference predicts that the contribution of digitalization to Australia's GDP will be between AUD140-250 billion by 2025.\nConcerns about the risks and enormous potential of AI are giving rise to a spate of industry, intergovernmental and government standards and guidelines. In 2019, based on wide public consultation, the Australian Government's Department of Industry, Science, Energy and Resources developed a set of eight 'aspirational' principles to be used when developing and deploying AI, including a focus on benefitting society and the environment; maintaining respect for human rights; diversity; and autonomy . The European Union makes human agency and oversight, technical robustness, safety, privacy, data protection, transparency, diversity, nondiscrimination, societal and environmental well-being and accountability the key ethical requirements for AI development and deployment .\nTranslating such principles into policy and practice remains a challenge. Regulating practices is even more challenging. It is therefore critical that professionals working in AI environments are well aware of potential consequences of the technologies they develop and deploy, sensitive to the ethical issues involved, and oriented towards actively using these technologies to the benefit of society. For this reason, in many countries, there is a requirement that undergraduate engineering degrees include training in ethics as preparation for the opportunities and ethical dilemmas students will face in their future careers.\nAll Australian engineering undergraduate courses are mandated to have an ethics component, often as part of the 'core' components which all students undertake. But it is not clear whether Australian engineering ethics curricula keep pace with the changing priorities and challenges of the profession. Since reference called for an expansion and reimagining of engineering ethics education in Australia, a few studies have examined the challenges of providing effective engineering ethics education , . However, there is a need for a current, comprehensive survey of university engineering ethics courses in Australia. Our project aims to address this gap. In this paper, we present early findings on the ethics courses of Australian Computer Science (CS) undergraduate degrees."
    },
    {
      "title": "ETHICS EDUCATION IN COMPUTER SCIENCE COURSES",
      "content": "To understand the evolution and current status of ethics education in CS, it is helpful to contextualize it within the history of engineering ethics education. The introduction of ethics education in engineering is surprisingly recent, with the US taking the lead and other nations in Europe and Australia following a few years later, in the early 2000s . The lack of ethics education is attributed to the perception of engineering as a 'pragmatic profession' favoring precision and practical concerns over interesting speculations . Interest in introducing ethics education is observed to have peaked around the turn of the century and has been linked to the growing desire to promote sustainability and waste reduction . In most countries, engineering courses are accredited by professional bodies with associated ethics courses that are modelled on the codes of ethics of these bodies. Early on, engineering codes of ethics were limited in focus, and organized around issues concerning professional practice, such as honesty, avoiding conflict of interest, not going beyond one's area of competence, and matters of risk and safety . Engineers were expected to have 'traditional values such as obedience, loyalty, reliability and competence in job performance' .\nThe post-war years saw the addition of a range of other obligations, concerning 'the health and well-being of the general public, environmental pollution, the exhausting of natural resources, sustainability, and human rights and the operating of businesses and the actions of engineers in nonwestern countries' . These obligations sometimes placed engineers in situations of conflicting loyalties and interests. For example, loyalty to their employer might interfere with the obligation to the public. It was these dilemmas that led to making professional codes of conduct more meaningful and clearer in their application to issues engineers actually faced in the profession, including responsibility towards society and environmental sustainability. With the growth of AI and fears about the profound impacts of these technologies on individuals and societies, the codes of ethics of professional bodies have begun to expand to reflect these new concerns.\nThese developments are mirrored in the changing focus of engineering ethics courses, albeit with some delay and to varying extents. Early on, the focus of ethics teaching was on professional issues -conflict of interest, 'public health and safety, quality, usefulness, efficiency, cost/risk/benefit analysis, environmental harm, trustfulness, trustworthiness, loyalty' -rather than moral issues . At the turn of the century, there were calls for a shift in focus from micro-ethics concerning dilemmas faced by individual engineers, toward macro-ethics which was concerned with issues such as social responsibility . Building on earlier work calling for change to engineering ethics in Australia and exploring curriculum change - , our broader project aims to examine ethics curricula of Information Technology (IT) degrees (accredited by Engineers Australia -EA, and informed by its code of ethics), and Computer Science (CS) degrees (accredited by the Australian Computer Society (ACS), and compliant with the ACS code of ethics). Here we present preliminary findings from our analysis of Australian CS undergraduate degrees."
    },
    {
      "title": "METHODOLOGY",
      "content": "A list of all Australian universities -43 in number -was generated from the 'Study in Australia' website 1 published by the Australian Government. The website of each university was screened to ascertain if they offered an Australian Qualification Framework (AQF) course at a level 7 (Bachelor's degree). Thirty-seven universities had a CS or IT based Bachelor's degree course (BCompSci, BIT, BSci(Comp)). Each of these 37 universities was then individually assessed, based on the materials publicly available on the website (course information and course structure), to gauge when and what education related to ethics and professionalism was delivered within the courses. In this paper, we report on 12 universities which offer a Bachelor's degree in Computer Science and mention 'ethics' in their course description. As each university structure is different and each website had varying levels of information, as much information as was available was used. This information was gathered in a spreadsheet, indicating the university, course, and the specifics of the ethics content offered.\nA conceptual framework was developed as a heuristic to map the content of different courses, drawing on the conceptual work of reference . Our framework is a synthesis of the components of a range of professional frameworks, including those of Engineering Australia, Australia Computer Society (ACS), and World Federation of Engineering Organizations (WFEO). The content of different courses was plotted against this synthetic heuristic."
    },
    {
      "title": "FINDINGS AND IMPLICATIONS",
      "content": "We present the preliminary analysis based on publicly accessible information from the websites of 12 universities offering the CS undergraduate degree in Table 1. The left column contains a range of concepts or domains of ethics synthesized from a variety of codes of ethics, as detailed in Methodology. We have organized these into three categories: Micro-Ethics, Ethics Philosophy and Macro-Ethics.\nMicro-ethics is further divided into personal attributes and ethics related to institutional and professional aspects. In some universities, there is an effort to teach Ethics as a philosophical subject. Macro-Ethics refers to the outward-focused view of engineering ethics, in which graduates are expected to view their profession in relation to society, to actively engage with society, and to act in the public interest. They are required to anticipate possible harms and to actively promote sustainability, equity, and the quality of life. The right column lists areas of ethical study, drawing from phrases used in the ethics curricula surveyed. The numbers next to each concept denote the code we have given to each university. \nInformation access (7) Computer crime (7)"
    },
    {
      "title": "thics -Theories and Philosophy",
      "content": "Ethical dilemmas ( There is wide variation between Australian universities in terms of when and how Ethics is incorporated into CS courses. In some cases, they manifest as a specific module or unit of study (subject), and in others they are distributed across different modules and units of study, with different subject teachers incorporating concepts related to ethics and professionalism into their own subject. There is also wide variation with regard to when these courses are taught, with most introduced in the first year as a core module, or in the third (final) year as a 'capstone' unit.\nDifferent universities emphasize different aspects of ethics. The most emphasized aspect appears to be professional/institutional ethics, reflecting the emphasis on these aspects in early iterations of the ethics codes of accrediting organizations. Interestingly, while early surveys of ethics curricula reported the inclusion of such topics as personal integrity and trustworthiness , , these now appear to be absorbed into professional ethics. While more research including interviews with course developers would be required to confirm this, we speculate that in these times of accountability and transparency, there is less reliance on individual honesty and integrity -and therefore less need to emphasize these attributes. Instead, these attributes are inscribed into ethical codes and accountability measures.\nOnly two universities teach ethics philosophy as part of their course. While we have yet to empirically explore the efficacy of teaching philosophical ethics, prior work advocates situated, contextualized exercises, lest students face challenges in applying ethical principles in practice .\nThe importance of macro-ethical concepts is growing as CS and IT are increasingly implicated in political, economic and social life. The impact of the work of Cambridge Analytica, and the current debates around whether social media organizations are obliged to fact check posts on their platforms, are just two examples highlighting the deepening impact of CS and IT practice on the wider society. Beyond harm prevention, there is now also interest in the active promotion of the good of society and the planet through technology in aspirational government policies , . While 10 of the 12 universities in our preliminary analysis have some content related to macro-ethics, indicating an interest in this area of the ethics curriculum, most cover just one or two aspects of macro-ethics. Further research is required to examine the extent and efficacy of these curricular inclusions."
    },
    {
      "title": "CONCLUSIONS AND FUTURE WORK",
      "content": "AI-infused technologies continue to proliferate with significant consequences for individuals and societies. Preparing prospective graduates to understand the relationship between technology and society and to actively promote sustainability, fairness, inclusivity and social justice is crucial. Our preliminary findings suggest that there is wide variation in the content of ethics courses in Australian CS curricula. There is greater emphasis on professional ethics and both philosophical and macro-ethical aspects appear to be neglected. We observe more interest in ensuring compliance with codes and standards and less on actively using technology to promote social good.\nOur broader project aims to survey the current status of ethics in Australian engineering universities, with a view to creating recommendations for content, pedagogies and modes of teaching as well as effective assessment of ethics learning in these courses. We aim to gain an in-depth understanding of the current situation by supplementing our website-based research with a study of detailed course materials and interviews with relevant academics in a sample of universities. In particular, we are keen to develop a more comprehensive understanding of how macro-ethics may be effectively incorporated into CS and IT education. This will be an ongoing challenge given the pace of technological, sociological, and legislative change in this critical domain."
    }
  ]
}