{
  "title": "Comparison of Privacy-Preserving Models based on a Third-Party Auditor in Cloud Computing",
  "sections": [
    {
      "title": "Abstract",
      "content": "Preserving) with existing known privacy preserving model."
    },
    {
      "title": "NTRODUCTION",
      "content": "Cloud computing is a utility-driven, based on \"pay as you use,\" technology for remotely sharing the information technology resources rather than having local servers or personal devices handle applications . Cloud computing is developing as a paradigm that aims to deliver dependable, personalized, with guaranteed quality of service, computation environment for the cloud clients. In cloud computing, and from the end user perspective, ITrelated skills are provided as services, accessible without requiring in-depth knowledge of the underlying technologies, and with a nominal management effort. The term cloud refers to the storing of data anywhere and accessing it anytime. The stored data can be obtained by users who have adequate and required permissions. There are many characteristics associated with the cloud, as defined in . Cloud computing supports four delivery models: public cloud, private cloud, community cloud, and hybrid cloud .\n• The public cloud can be used for data that is not extremely sensitive and where the integrity of the data is subject to frequent changes. • The private cloud can be used for data that is highly confidential and is made available only to a small number of users. • A community cloud is a form of the public cloud where several customers share the same infrastructure with a community formed from other entities that share the same interest. • The hybrid cloud is a combination of two or more clouds; they also apply to clients who want to keep their most critical data on-premise and deploy their essential data on the cloud. It can be private, community, or public but are bound together by standardized technology. The hybrid cloud offers enhanced security at a lower price but could end up with high management complexity . Cloud computing integrates different technologies and strategies to protect clients' data. The cloud service providers compete on using the latest security schemes. Nonetheless, there are still many ambiguities, security-wise, that are making many companies skeptical from fully embracing the cloud realm . In cloud computing safety, security and privacy of data are essential metrics which build the trust level of the clients. Cloud computing is vastly used in different domains (e.g., social, economic, industries, financial institutions, government offices, educational institutions). Thus, individuals store their confidential data through cloud computing. Hence, before adopting the design and development of cloud computing, security requirements and privacy should be thoroughly investigated. Many companies, as well as individuals, are still skeptical about cloud computing when considering the security vulnerabilities associated with it. There are still no specified privacy and security protection laws explicitly created for cloud computing . Many researchers are focusing on identifying the security and privacy issues which can be faced by cloud computing clients. Another area of research explores how to select trustable and suitable cloud providers to minimize security and privacy risks. To handle security issues, particularly privacy issues, the concept of TPA is introduced. The TPA has the expertise and the capabilities that the CC's and CSP's do not possess. The TPA is trusted to assess the CSP's storage security upon request from both the CC and the CSP, so the data is immune from Byzantine failures, malicious data, data modification attack, and even server colluding attacks.\nThe main contributions of this comparison analysis paper could be summarized as follows:\n• The state-of-the-art on privacy-preserving paradigms for cloud computing based on a TPA is discussed.\n• The CSP's vulnerabilities that provide a platform for a malicious TPA to use and generate the threats for data privacy are discussed. • Simulations experiment on the four most eminent PPM compared to our previously introduced LAPP.\nThe remainder of the paper is summarized as follows:\nSection II discusses the cloud vulnerabilities. Section III presents TPA's comparison of security factors. Section IV discusses the simulation parameters and results. And Section V concludes the entire paper."
    },
    {
      "title": "CLOUD VULNERABILITIES",
      "content": "The data on the cloud should be encrypted without leading to major processing overhead. Considering the benefits of cloud computing, various organizations leaning towards cloud-based IT solutions. However, before starting the journey to the cloud, adopters must consider the possible vulnerabilities depicted in Figure-1that may convert their dreams of enhancing scalability and saving management cost into a nightmare of either data loss and misuse . Hence, users must consider the risks involved with cloud adoption. The cloud experiences the vulnerabilities ( e.g., lack of trust, loss of control). As, these vulnerabilities greatly affect several security requirements such as privacy, authentication, authorization, accountability, privacy, confidentiality, integrity, non-repudiation, access control, and availability. Based on these vulnerabilities, different types of threats are possible such as re-entry, intoxication, Byzantine, colluding, discrimination threats."
    },
    {
      "title": "Possible Threats to Cloud Computing",
      "content": "The threats on cloud result from various vulnerabilities in the security requirements depicted in Figure 1.\nCollusion threat Consists of a threat from malicious cloud users who use feedbacks to manipulate trust model results. It is called a Collusive malicious feedback attack . It consists of three types:\nSelf-Promoting: consists of promoting a Cloud service provider. Malicious cloud users enter significant positive feedback. Slandering: to defame a cloud service provider. Malicious cloud users enter Significant negative feedback.\nOccasional Collusion Feedback attack: in this case, the user occasionally enters significant positive or negative feedback. b) Intoxication Attack Malicious users behave alternatively in ethical or bad fashions . In other words, the user first acts normal, but as time progresses, the user starts to misbehave after earning trust. These types of users are difficult to identify. This vulnerability is also called the dynamic personality of peers in the p2p network system. Uses a Forgetting factor technique to resolve this problem."
    },
    {
      "title": "c) Discrimination Attacks",
      "content": "When a CSP delivers different qualities of services provided to CSU's, it could result in different ratings to these providers and impact their trust. Then the group who offered contradictory results might be labeled as dishonest. To date, there is no practical solution to mitigate such an attack.\nReentry threat It consists of the case when the user who previously produced bad behavior reenters with a new identity to attack again . It is called newcomer or reentry Attack. By comparing credential recodes using location, unique id, we can reduce reentry Attacks. Based on our study, dynamic auditing factors are given as RSA based storage security supports dynamic operation and identifies misbehaving servers in the cloud. However, TPA has control of the private keys (which is deemed unsafe). Privacy Negotiation Mechanism protects against Byzantine failures by dynamic auditing and server colluding attacks. However, it does not guarantee the privacy of the user's data. Privacy-preserving public auditing is highly efficient for dynamic groups, but it consumes more time and bandwidth to achieve high error detection probability. Third party storage audit service protects the privacy of the data, and it has less communication cost. In some cases, due to dynamic operations, which tend to make the auditing protocol insecure."
    },
    {
      "title": "b) Lightweight security",
      "content": "The novel third-party auditor scheme ensures data confidentiality using encryption techniques leading to secure authentication. Data Privacy by authenticating and secret sharing achieve mutual authentication between the client and the server. This method reduces the information cost in secret sharing. In the SCLPV technique, the malicious auditor cannot have much impact on security. Also, safety is guaranteed by the large verification overhead."
    },
    {
      "title": "c) TPA acting as a verifier",
      "content": "While protecting data privacy in the public cloud, the verifier is not trusted. In the Knox and Oruta approach, during the verification phase adversary may corrupt the data. A designated public verifier can significantly improve reliability, which leads to a reduction of the computational burden."
    },
    {
      "title": "d) Adopting a TPA as Trust Party",
      "content": "Public auditing mechanism reduces computation and communication overhead. Sometimes there can be a problem of internal attacks. While managing trust in TPA, security strength is effective. However, feedback from the cloud user is not supported. Data confidentiality is enhanced by utilizing the encryption scheme, also reducing the computational burden. Centralized trust model approach establishes a high-level of trust for cloud users, and updating changes are made easy. However, cloud user feedback cannot always be trusted."
    },
    {
      "title": "e) Access to audited data",
      "content": "TPA achieves better efficiency while performing multiple auditing tasks using a homomorphic non-linear authenticator and random masking technique. However, a local copy of the data can be present in the TPA. To maintain strong anonymity in a cloud environment, a data possession scheme can be used. During auditing, recovering the singleton losses is efficient by using the layered interleaving technique. However, the TPA should not get hold of the user's data content."
    },
    {
      "title": "f) Data Redundancy",
      "content": "In the PoOR scheme, the traffic cost is optimized. However, there is a problem with data duplication, which could lead to data redundancy. Centralized trust model approach significantly establishes the trust for cloud users and made updating changes easy. However, we cannot always trust cloud users' feedback cannot in this scheme."
    },
    {
      "title": "SIMULATIONS SETUP AND RESULTS",
      "content": "As detailed in our previous publication introducing LAPP , below is a recapitulation of the main simulation parameters given in table 1. In this round of simulation experiments, we compared our introduced method LAPP to the below methods:\nSecurity and Privacy for Storage (SPS) . Panda Public Auditing (PPA) Privacy-Preserving Public Auditing (PPPAS) Secure and Efficient Privacy-Preserving Public Auditing (SEPPPA) Protocol .\nOur experiments were conducted using Greencloud platform. The experiments have been obtained based on the malicious attempts at the following rates: 0%, 1%, 2%, and 5%, and for the sake of simplicity we are only presenting the graphs with 0% and 2% malicious activities. We have conducted the following experiments:\nThe processing time versus the volume of data The average auditing time of each service user versus the number of clients in the system."
    },
    {
      "title": "The processing time versus the volume of data",
      "content": "Figures 3 and4 illustrate the change in the needed processing time versus the volume of data that has been processed with no malicious attempts in figure 3 and 2% in figure 4; adding 5 MB of data at a time. The simulation results show that LAPP requires less processing time than the method it has been compared against, as we progress in time."
    },
    {
      "title": "CONCLUSION",
      "content": "In this paper, we have recapitulated and compared the state of the art of the existing PPM methods and studied cloud security when having to benefit from the services of a Third-Party Auditor (TPA). The TPA's role in cloud computing is to assure the auditing function on behalf of the client and to establish a secure connection for the sake of achieving the integrity of the data. Nonetheless, there are some issues mainly related to trust that could emerge from involving a TPA. Many research approaches addressing security using a TPA and proposing solutions have been elaborated.\nTo pursue this goal, we have studied the most recent TPAbased approaches, classified them based on their adopted security methods using mind-map; and recapitulated these methods based the security requirements. The comparison analysis starts with the vulnerabilities of the CC that are discussed and provide the different scenarios for the TPA to use and generate threats on the CC's data privacy. The study reveals the major impact brought in by the TPA's adoption in securing cloud computing. This option comes with its concerns, as adopting a solution with a TPA can come with trust concerns, extra overhead, security, and data manipulation breaches. The privacy-preserving models are classified and categorized, focusing only on the dynamicity of the TPA. Furthermore, the limitations of each privacy preserving model are extensively discussed, concluding with suggested recommendations for future improvement. Based on the comparison analysis, we recommend to researchers to plan and orient their efforts towards developing a more simplistic lightweight, and secure solution compared to our proposed method LAPP that should help alleviate the gap in the cloud users' decision compromise and to increase the trust in adopting a solution based on a TPA."
    }
  ]
}