{
  "title": "Ethics and Military Engineering Operations",
  "sections": [
    {
      "title": "Abstract",
      "content": "Imagine the following three-variable Venn diagram: One circle represents the field of applied and professional ethics, a second circle represents military operations, and the third circle represents the practice of engineering, particularly construction projects. We can, without much difficulty, picture what the overlapping areas between any two circles refer to: engineering ethics, military ethics and military engineering. What I would like to address in this paper is the area common to all three circles: is there room for a unique field of ethics called \"military engineering ethics\"? I contend that there is, and in this presentation I propose to sketch out why and what that might look like."
    },
    {
      "title": "NTRODUCTION",
      "content": "Suppose a project engineer shows up at an active construction site and finds that none of the workers is wearing a hardhat; no one, not even the safety supervisor. Should the project engineer halt operations until this obvious safety violation is rectified? Further suppose that this engineer is there to discuss the project's progress and is able to release some funds to the contractor. At a meeting, the construction company's representative offers the project engineer 5% of the funding approved as an \"incentive\" for the engineer to report more progress than he really sees. Should the project engineer accept what is essentially a bribe?\nExamples like these might be considered \"no-brainer\" case studies in any contemporary engineering ethics course. Suppose, however, that these examples took place in Afghanistan and that the project engineer was an officer deployed there with the US Army. Does the fact that the construction project is in a warzone change the answers to our questions? I propose that the answer to that question is \"maybe.\" In what follows, I will briefly and very broadly define the components and clarify the circumstances surrounding these specific cases: engineering ethics in military construction sites in a warzone."
    },
    {
      "title": "MILITARY AND ENGINEERING ETHICS",
      "content": "Courses in ethics often fall in one of two categories: they are either theoretical or applied. The former covers the philosophical underpinnings of moral systems, the careful study of right and wrong (and perhaps what those terms mean), the contributions of various philosophers (Aristotle, Hobbes, Kant, Mill, etc.) to the field, and so forth. The latter seeks to make these philosophical concepts relevant to a particular field of knowledge or practice. A course in medical ethics, therefore, focuses on moral dilemmas encountered by-or affected bymembers of the medical profession and addresses questions such as the standards of care, end of life issues, experimentation, autonomous consent, genetics, and others.\nMuch like medical ethics, then, engineering ethics focuses on the moral questions that engineers are likely to encounter. Engineering ethics courses normally address matters like whistleblowing, state-of-the-art design, issues of public safety, liability and risk assessment, and, more recently, identifying and fighting corruption and the engineering profession's responsibility towards sustainable development. 1Similarly, a course in military ethics seeks to make ethical concepts relevant to the sorts of things military people do-or things that the military does that affects people. Generally, there are two major genres covered: one related to the ethics of the application of military force and the other pertaining to the morally unique features of military life and service. Just war theory typically figures prominently in the teaching of the first genre, while various models of leadership and professionalism are often discussed when addressing the second genre.\nJust war theory-though some prefer to substitute \"theory\" with \"tradition\"-has been around for centuries. Cicero, Augustine, Thomas Aquinas, Grotius, Clausewitz and many others have contributed to this tradition, but we probably owe the terms we use more commonly today to Michael Walzer and his seminal work, Just and Unjust Wars, published in the 1970s .\nWalzer clearly separated questions about the morality of war into two categories: jus ad bellum and jus in bello. Jus ad bellum, literally \"justice in going to war,\" refers to those questions about when entering into war may be morally acceptable. Under this category our dilemmas about the use of force are informed by principles such as \"just cause,\" \"right intention,\" \"proper authority,\" etc. Jus in bello, meaning \"justice in war,\" refers to questions about what actions are morally permissible in the conduct of war. In this category one might ask whether a particular weapon system is consistent with the principle of \"military necessity\" or whether it would still be appropriate to conduct a particular operation that carries a high risk of \"collateral damage.\"\nIn the last few years, a third category of just war theory, jus post bellum, was further developed. In this category, justice after war, we examine questions about what moral obligations are incurred by the various parties (attacking, defending, etc.) once the conflict has ended. Are there treaties that ought to be put in place to protect certain segments of the population? Should military and/or political leaders be held legally responsible for the damages (to persons, to infrastructure, etc.) the conflict caused? . The literature that I have been able to review that discusses jus post bellum does not specifically address engineering efforts. As we will see shortly, however, military construction projects can reasonably be justified on the basis of our imperative to restore peace and this typically takes place in what we will later define as \"stability operations.\"\nIt is interesting to note that until quite recently I have not encountered engineering ethics textbooks that discuss military engineering specifically,2 nor any military ethics textbooks that specifically handle military engineering."
    },
    {
      "title": "MILITARY ENGINEERING",
      "content": "In this section I will elaborate on some important definitions and distinctions regarding military engineering, since I believe this is an area with which the audience might not be as well-acquainted. I will, however, quickly narrow the field down to the type of engineering that I wish to focus on: construction engineering in a combat zone."
    },
    {
      "title": "General Concepts",
      "content": "The term \"Military Engineering\" is, as one might imagine, quite expansive. Anything that marries the \"practice of engineering\" (a concept that is expansive enough) with the work of a nation's military can fall under it, including, for example, the work the engineer who designs anything that any of the US military services (Army, Navy, Air Force or Marines) use or deploys with (weapons, vehicles, computers, uniforms, etc.). Tackling the ethical implications of all of military engineering, therefore, would be impossible in this venue. I will therefor start by narrowing the field to what Army engineers do, particularly in combat.\nGround operations during times of war almost always have a complex engineering component, usually divided into combat engineering and construction engineering. Combat engineering refers to things like building bridges to help maneuver elements reach their objectives, creating obstacles in order to hinder the enemy's movement, and so on. Construction engineering, on the other hand, refers to things like building Forward Operating Bases (FOBs) to stage our forces and working construction projects that help build (or rebuild) the infrastructure of the countries in our area of operations.\nWhen we use the term \"Army Engineer\" we therefore have to make a distinctions, more or less along these lines. When we talk about combat engineering, the Army has specialized engineer units, made up of engineer-soldiers. In other words, the \"Corps of Engineers\" in this sense refers to a branch of the US Army (like Infantry, Field Artillery, Military Police, etc.). When we talk about construction engineering, on the other than, we typically refer to the \"US Army Corps of Engineers\" (abbreviated USACE), which is the United States agency that manages construction engineering for the Department of Defense. USACE's mission is to \"Deliver vital public and military engineering services in peace and war to strengthen our Nation's security, energize the economy, and reduce risks from disasters .\" USACE has \"districts\" (akin to regional offices) all over the United States, as well as in Germany, Japan, Korea, and the Middle East, including two districts in Afghanistan. USACE is responsible for construction or reconstruction of infrastructure and facilities, including the design, construction and maintenance of all Army and Air Force bases' facilities all over the world. In the continental United States, USACE's tasks also include emergency preparedness, environmental engineering, maintenance of the country's waterways, etc. In Afghanistan and Iraq, however, USACE manages the construction of facilities and roads that fulfill the mission of our military and nation-building operations in-country."
    },
    {
      "title": "USACE in Afghanistan",
      "content": "The Afghanistan Engineer District (AED), where I spent a year deployed as a Resident Engineer, focuses its construction efforts on projects that support the Afghanistan National Security Forces (ANSF, which encompasses the Army, Border Patrol, and the Police), but increasingly has taken on general infrastructure projects such as roads and mini-hydroelectric power plants.\nAED was task-organized under the administrative control of the Combined Security Transition Command-Afghanistan (CSTC-A), which, in turn, was under the operational employment of the International Security Assistance Force (ISAF, which is a NATO operation). Through this chain-of-command (far more complicated than meets the eye) AED was given a prioritized list of construction projects to manage.\nOther entities with engineering capabilities operated in theater, such as the Provincial Reconstruction Teams (PRTs) and maneuver units' engineer assets. Because these capabilities were limited, they tended to deal with small projects (both is scope and cost). AED therefore managed only large projects, averaging $1 million, in its Area of Responsibility (AOR), which included the entire country of Afghanistan plus some bordering regions in Pakistan and Tajikistan.\nUnder each district, construction projects are lumped by regions and senior-managed at Area Offices, which is the level where AED-through an Area Engineer-has an opportunity to coordinate its efforts with maneuver units in-country. Under the Area Offices, several Resident Offices, such as the one I led in Gardez, take care of the bulk of the actual project management. These Resident Offices, based on the overall geographic distribution of projects, sometimes were further subdivided in project offices (I had a Project Office in Ghazni, for example).\nDuring my tenure the Gardez Resident Office, with a staff of one resident engineer, 4-5 project engineers, 4-5 quality assurance engineers, and a crew of about 25 Afghan nationals under the Local National Quality Assurance (LNQA) program, managed approximately 70 construction projects in 4 provinces, placed over $90 million in construction payments to contractors, and managed the Operations and Maintenance (O&M) functions for the Afghan Army base we inhabited. The typical mix for a Resident Office was 2-3 military members to 10 or so civilians. It is important to understand, however, that AED (through the Resident Offices) only managed construction projects (i.e., performed quality assurance inspections, reporting functions and paid the contractors). To the maximum extent possible Afghans (people and companies) were intimately involved in all phases of construction, from design to ribbon-cutting.\nPlanning combat operations, deploying forces and fighting our nation's air, land and sea battles are clearly the military's raison d'être. When the US military plans joint operations3 they follow a doctrine that calls for a phased approach. These phases are: (I) Deter, (II) Seize Initiative, (III) Dominate, (IV) Stabilize, and (V) Enable Civil Authority . The first three phases are, as one might imagine, where the bulk of the fighting takes place, so here engineering efforts are mostly in the combat engineering realm. In the next two phases, however, where the intent is set the conditions so we can return to peace, so-called \"stability operations\" increasingly include engineering projects like the ones managed by USACE.\nTo be clear, then, here I wish to focus on construction projects that take place in a warzone like Afghanistan, but that, admittedly, happen after major combat operations have ended, which is why in terms of just war theory it falls under the purview of jus post bellum considerations. Although it is at times difficult to discern what, exactly, \"combat operations have ended\" means in practice, my point is that the focus of USACE, and the kinds of cases I want to highlight, is in the stability phase of the operation where, though still dangerous, is not the same as the operations maneuver units are conducting to shape the battle space."
    },
    {
      "title": "BACK TO OUR EXAMPLES",
      "content": "Now that we have a clearer picture of the function of USACE in a combat environment, we are ready to return to the cases I opened with in the introduction. Let us first take the issue of enforcement of safety standards.\nComplying with safety requirements, though clearly morally laudable, and in the vast majority of the cases the right thing to do, was extremely difficult in Afghanistan for two reasons. First, there were often security concerns that would not cross our minds in the United States. Specifically, I had a bridge project in Gardez where local workers simply refused to wear hardhats (again, a perfectly sensible safety precaution under normal circumstances) because doing so would identify them (read \"target them\") as people who supported the United States. In that particular construction sites, asking workers to wear hardhats was tantamount to asking them to wear vests with bull's-eyes on them. In extraordinary cases like these, then, is it reasonable for AED to insist on enforcing US standards of safety in Afghanistan?\nSecondly, the additional cost involved made it difficult for the contractor (or, more often, the subcontractor) to enforce appropriate safety standards. Hardhats, especially the ones that comply with US safety standards, are not cheap. To take another common example, whereas in the United States we are used to seeing bright orange mushroom-looking caps on all exposed rebar, such materials in Afghanistan were just too expensive for an average company to handle without tearing into their profit margins.\nClearly we could argue that there may be cases where the profit margin ought to be adjusted to accommodate the safety standard. Contractors in Afghanistan, as it turned out, were often making an overwhelming profit on a project, leaving the subcontractor little option but to cut corners where they saw possible in order to make due. The point is that there is an added complexity to the story that might very well compel us to change our decision to enforce (or let slide) what would otherwise be a clear decision about safety.\nTurning to the example about the contractor offering the project engineer a bribe so that he can report more progress than he sees during his inspection, this is a pretty straight forward case of corruption. I am disappointed to have to report that in the face of such rampant and systematic corruption, the attitudes of many in USACE (and US forces in general) was that these sorts of practices where simply part of the local moral landscape and, though unfortunate, were merely \"the way things are done here.\" Although many people in positions of authority were able to deal with these situations appropriately (i.e., decline the bribe) some were not so morally stalwart.\nOther problems I was exposed to include the reluctance of the customer (Afghan end-user) to accept and/or occupy finished project sites due to security concerns, lack of sufficient oversight, and even problems with accuracy of reporting: AED manpower levels were dismally low, projects were rife with problems, etc., yet the AED's leadership continuously painted a rosy picture of its construction efforts to CSTC-A (our contractual customer). Being able to delve into ways of resolving these cases would be helpful to those who find themselves in the middle of these dilemmas, even if they do have more clear answers in peacetime correlate cases.\nSOME PROPOSED DIRECTIONS Although this section is, so to speak, the \"punch line\" of my presentation, I concede that I can only make some tentative and general suggestions as to the direction I think we can take.\nIt seems to me that when engineering construction projects take place in a war zone, putative engineering ethics principles may sometimes be inadequate or incomplete. In some cases, perhaps just war theory consideration, primarily jus in bello and jus post bellum, can illuminate the right approach to take. In other cases, perhaps putative engineering ethics principles might help guide the military engineer, even in the most dangerous of warzones.\nIn the hardhat example, it seems as though an inflexible adherence to the safety rules in place can results in an overall degradation of conditions (i.e., more lives lost). This might be a case where we find competing principles (enforcing a standard versus saving lives) and are compelled to resolve the dilemma by a W.D. Ross-like approach of rank-ordering which prima facie duties ought to hold sway over others, under what circumstances.\nWe might also take a more strictly utilitarian approach and argue that safety standards themselves exist solely for the intent to protect lives, and when the result is counter to that (as appeared to be the case in Gardez), it would be perfectly consistent with good moral decision-making not to require the workers to wear them.\nIn the case of outright corruption, however, I am far less inclined to acquiesce to \"local mores\" or \"the way things are done here,\" regardless of where it takes place. The fact that corruption is taking place in a warzone does not seem to affect the principles in play. In this case it seems as though engineering ethics can inform just war theory. I would distinguish this case from the first example in that there does not seem to be a competing duty that overrides the principle behind rejecting the bribe."
    },
    {
      "title": "CONCLUSION",
      "content": "What I have done here, I hope, is to prompt some discussion in the direction of solving some unique cases that might surface in engineering ethics. It seems counterintuitive, for example, for an engineer to relax safety standards in a construction site, yet I have introduced a case where maybe that is the right thing to do. I do not intend to say that any time an engineering dilemma takes place in a combat environment it is automatically excused from normal engineering ethics considerations. Yet perhaps there are examples of situations that do warrant special consideration.\nAdmittedly, military construction projects that take place in warzones comprise a miniscule percentage of the construction projects worldwide. It therefore appears as though my call to investigate how engineering ethics principles might be revised or mitigated under wartime circumstances applies to so small a group as to be rendered unimportant or uninteresting. But for those who deal with these situations on a day-to-day basis, such as Army personnel deployed in support of USACE in a region like Afghanistan, some clarity would certainly be welcome. Opening the discussion in venues like this one may indeed help."
    },
    {
      "title": "SCLAIMER",
      "content": "The views expressed here are solely the author's and do not necessarily reflect the views of the US Air Force Academy, the U.S. Army, or the U.S. Government."
    }
  ]
}