{
  "title": "Ethics of Artificial Intelligence for Cultural Heritage: Opportunities and Challenges",
  "sections": [
    {
      "title": "Abstract",
      "content": "Artificial Intelligence (AI) has witnessed remarkable advancements in recent years and has significantly impacted various domains, including cultural heritage. Indeed, AI technologies offer unprecedented capacities to analyze huge amounts of historical data, enabling researchers and art historians to uncover precious patterns, connections, and insights that might otherwise remain elusive. Also, the efficiency and accuracy of AI techniques play a pivotal role in many cultural heritagerelated tasks, such as cataloging and organizing extensive cultural collections, streamlining the management of heritage resources for present and future generations. However, the integration of AI in cultural heritage also brings forth intricate ethical questions. These span over the issues of authenticity, subjectivity, and interpretation biases of an AI-empowered, reproduced, and/or generated artwork up to the legal concerns related to authorship. However, such issues are mostly undefined and unaddressed in the scholarship at the intersection on AI, ethics, and cultural heritage. This paper aims to pave the way to fill such a gap of context-sensitive ethical issues for AI in cultural heritage. To this aim, the paper first analyzes the main opportunities and benefits raised by AI in cultural heritage. Then, matching benchmark, agreed-upon AI ethics principles elaborated in the AI ethics scholarship in the last decade and relevant to cultural heritage, it highlights specific ethical risks that ought to be considered for the development and deployment of trustworthy AI in and for cultural heritage. Finally, areas requiring further attention and work, and actors call to intervene, are identified to facilitate next steps for ethics and governance of AI in cultural heritage."
    },
    {
      "title": "Section",
      "content": "penetrating various previously unexplored areas, including creative and cultural sectors (hereinafter: cultural heritage). This is due to the unprecedented opportunities it showed to offer in this field such as the preservation and restoration of cultural heritage artifacts, promotion of museum collections through more engaging cultural experiences, user-tailored cultural offerings, and the creation of novel art forms through generative AI, just to mention a few. Indeed, the application of AI systems in the cultural heritage sector presents numerous benefits ranging from the automation of alienating and repetitive processes, the recovery of precious but lost cultural assets, as well as more immersive and fulfilling visitor experiences. For instance, Deep Learning (DL) models can automatically describe works of art, identify the artist, context, and period of the work, and overcome attribution or interpretation disputes . Generative Adversarial Networks (GANs) further improve cultural heritage restoration processes by reconstructing missing parts of frescos or paintings . Extended reality (XAI) techniques such as those for augmented (AR) and virtual reality (VR) help introducing new audiences to art and culture, assisting cultural organizations in fulfilling their educational mandate, and providing a more inclusive and engaging visitor experience.\nThe diffusion of AI in the cultural heritage field has also been prompted by the drive for digitization supported by two main levers. First, an institutional lever: organizations like the European Commission (EC) and UNESCO stress the importance of digitizing cultural assets through the promotion of programs like Europeana . Indeed, cultural digitization policies seek to democratize culture by promoting accessibility and interoperability, information sharing, and the protection of cultural identity. Second, the wide endorsement of the so-called \"adaptation approach\" to cultural heritage management and preservation enhances the cultural sector's digital transition.\nIndeed, rather than focusing on protecting cultural heritage from the harmful effects of human presence (previous approach, called \"mitigation approach\"), the adaptation approach contends the preservation of cultural heritage as ensuring cultural continuity and giving heritage new values and meanings that depend on changes in society . Therefore, in this scenario, the digitization of cultural heritage is promoted as an adaptation to the changes in a society that is continuously evolving, responding to the concept of \"cultural continuity\" . Due to the social relevance of cultural assets and the morally-loaded dimension of cultural heritage, it is also crucial to consider the ethical and social implications c 2024 The Authors. This work is licensed under a Creative Commons Attribution 4.0 License.\nFor more information, see https://creativecommons.org/licenses/by/4.0/ that AI technologies may raise when deployed with cultural heritage. Indeed, AI technologies are never neutral: they embed directly or indirectly socio-political, economic, and cultural values and agendas which can improperly affect cultural heritage. Challenges such as incorrect interpretation, historical and cultural biases, and economic and cognitive discrimination can counterbalance benefits provided by AI to one of the finest forms of human expression: art and creativity. Nevertheless, from an ethical and governance standpoint, such risks and issues concerning the specific cultural heritage sector have yet to be explored. This is problematic insofar as to develop digital transformation policies that maximize benefits and minimize risks, it is essential to take a sectoral perspective that complements the generally adopted horizontal view in AI ethics and governance landscape , . Although the UNESCO Recommendations on the Ethics of AI and the Ethical Guidelines for a Trustworthy AI , proposed by the high-level expert group on AI (HLEG-AI) set up by the EC, can help guide the trustworthy use of these technologies in general, there is still no specific ethical compass for using AI in the cultural heritage sector in an ethical and trustworthyoriented way. This paper aims to address such a gap by expanding on the first work of this kind elaborated in the field, entitled \"Design of an Ethical Framework for Artificial Intelligence in Cultural Heritage\" , by further developing context-sensitive ethical considerations, risks, and issues, supported by sector-specific cases and examples, and proposing a call to action to pave the way for the development of effective, sector-specific guidelines for trustworthy use of AI in cultural heritage. In particular, this paper deepens and extends the ethical issues mentioned in the cited paper focused on finetuning AI ethics principles for the cultural heritage sector by mapping onto existing high-level AI ethics frameworks and principles. This works extrapolates and elaborates on opportunities and ethical risks stemming from the use of AI in cultural heritage through the analysis of sector-specific ethical principles developed in such a refined framework. To do so, a cross-search of keywords from the cultural heritage field with those from AI (ML and DL) and AI ethics was conducted to identify scientific scholarship of interest. To identify relevant scholarship, three databases were used: Web of Science (WoS), Scopus, and EBSCO. WoS was chosen for its rigorous journal selection procedure, which is based on publication standards, expert opinions, regular appearances, and the quality of citation data, making it the most reliable database. Scopus was selected because it is the largest database of peer-reviewed literature and EBSCO was included to ensure comprehensive coverage and that no relevant articles were overlooked. In selecting reference articles, we used the following inclusion and exclusion criteria:\nWe included scientific papers focused on the application of AI in the cultural sector, specifically those dealing with generative AI for artwork production, AI for artwork restoration, AI for artwork cataloguing, and AI for creating immersive experiences in the art sector. 2. We included papers addressing AI ethics, as well as those concerning ethics and aesthetics in cultural heritage.\nWe included papers and policy documents that provided ethical recommendations and guidelines on the use of AI. 4. We excluded articles related to AI technologies that do not pertain to cultural heritage. On the relevant papers collected, we conducted a qualitative content analysis to identify key issues and highlight recurring themes and ethical considerations. In order to reduce subjective bias, content analysis was manually and independently carried out by two authors. The main themes and insights from the fragmented literature were reinterpreted by applying highlevel AI ethics principles as analytical lenses. This approach led to the creation of specific, context-sensitive, and clear ethical considerations related to AI in cultural heritage, addressing existing gaps in the literature. These considerations were then discussed in collaborative sessions to reach a consensus on the most critical ethical issues in the field. Three multidisciplinary expert workshops were conducted with co-authors and related partnered stakeholders. A total of 12 experts participated in the working sessions, coming from the fields of AI, AI Ethics, and cultural heritage (including two art curators, two art historians, and two visual artists). The experts included both academics and practitioners in order to ensure that the heterogeneity of professional and academic competencies involved in the field was adequately covered.\nFrom a procedural standpoint, we proceeded as follows. In the first workshop, the draft considerations were presented to gather stakeholder feedback. This feedback was then utilized by the authors to refine the ethical aspects and considerations emerging form the use AI in cultural heritage. During the second workshop, the reviewed considerations were presented for a second round of feedback and further integration. The final workshop focused on presenting the main results of the paper including the final framework of ethical considerations for AI in cultural heritage to the participants. After presenting the topics the experts were first asked for qualitative feedback through semi-structured questionnaires, which included three main questions: a) Are the presented ethical considerations for AI in cultural heritage adequate and exhaustive according to your background and field of (academic and/or professional) activity? b) If so, what would you add to enrich them based on your expertise? c) If not, what would you modify and why? Subsequently, a collective reflection was conducted on the themes and considerations presented, which arose from content analysis and were re-elaborated through existing highlevel AI ethics guidelines. From an ethical standpoint, the methodology to elaborate the specific ethical considerations before and after the collaborative sessions is detailed as follows. Alongside the content analysis of the collected papers, an ethical inquiry was conducted by the authors-comprising two AI ethicists, an expert in cultural heritage, and an expert in AI for cultural heritage. This inquiry involved examining the foremost techniques and applications of AI in cultural heritage, brainstorming on opportunities, as well as current and potential ethical risks. The analysis was framed using the primary AI ethics guidelines to ensure the trustworthy use of AI and the protection of cultural heritage, also taking into account widely discussed moral and societal issues in AI ethics and policy.\nThese ethical and policy documents along with scholarly articles related to ethical and aesthetic issues, such as cultural heritage's authenticity, interpretation, and dignity, proved to be critically important in incorporating the ethical challenges of the field into general ethical frameworks related to AI ethics. This comprehensive analysis facilitated the design of a call to action, aimed at proposing sector-specific guidelines for the trustworthy use of AI in cultural heritage.\nIn summary, building on general ethical principles for a trustworthy AI, this paper highlights the ethical challenges that arise from the various applications of AI in the field of cultural heritage and identifies areas where further work is needed and who is called upon to act. The objectives of this work are:\nDetermine the opportunities and benefits brought by the use of AI in the cultural heritage field;\nShine a light on the main ethical challenges and harmful consequences that AI can raise in a cultural and artistic context;\nIdentify areas of further work and the key players called into action to ensure ethical use of AI in cultural heritage; 4. Encourage an open discussion and informed debate on the ethical entailment of AI in cultural heritage, laying the foundation for the development of guidelines and measures that promote responsible and informed application of AI in the field, overcoming the generality of national and international standards by offering sector-specific ethical guidance.\nThe paper is structured as follows: Section II presents the main opportunities and benefits AI brings to cultural heritage regarding conservation, promotion, accessibility, and inclusion, drawing insights from the literature on AI for cultural heritage. Section III explores the ethical risks that AI arises when applied in the cultural context, matching AI and cultural heritage ethics concerns. Particularly, specific controversial scenarios in which the use of AI can undermine the preservation, inclusion, and interpretation of cultural heritage, including the people, groups, and societies at its core, are presented and analyzed. Section IV highlights both the areas requiring further attention toward ethical and trustworthy design and use of AI in the cultural sphere and the actors called into their action. Finally, Section V comments on the results of the discussion proposed in the article and provides final remarks, paving the way for future developments."
    },
    {
      "title": "AI IN CULTURAL HERITAGE: OPPORTUNITIES",
      "content": "AND BENEFITS AI presents itself as a powerful and innovative technology whose versatility and applicability in different contexts and sectors allow it to fascinate and conquer the field of cultural heritage. Although AI has only become the focus of public debate in recent years, applying Machine Learning, Deep Learning, and Computer Vision technologies in cultural heritage preservation and promotion has been practiced for nearly a decade. This cutting-edge technology provides three key opportunities, deeply explored in this section: accessibility and inclusion, cultural heritage preservation, and novel forms of creative production."
    },
    {
      "title": "Increased Accessibility and Inclusion",
      "content": "Under their educational mission, museums must ensure the accessibility of their spaces and collections to people with disabilities, such as the physically or the visually impaired. In addition, the United Nations (UN) Convention on the Rights of Persons with Disabilities sets forth the obligation of the adhering countries to \"recognize the right of persons with disabilities to take part on an equal basis with others in cultural life\" [10, art.30, p.22]. One of the categories of people most disadvantaged in the enjoyment of art is the visually impaired. The main problems of accessibility for visually impaired people belong to two main categories: 1. problems of physical mobility and the consequent inability to move independently in a museum space, and 2. problems related to the lack of non-visual alternatives to artwork . Although it is imperative to make content accessible to all, most museums and galleries' sight-centric design (which privileges sight over other senses) excludes people with visual impairments . Augmented reality (AR) is a great tool to face these problems. Different solutions have been developed to ensure inclusiveness in cultural enjoyment, and many of these technologies can be installed on mobile devices making their use affordable for everyone. Through mobile applications empowered by AR technologies that can provide interactive descriptions of the artwork and 2D visual access, cultural content can be improved, overcoming the obstacles of using tools that are difficult for visually impaired people to use, such as audio guides . In addition, through AR-based mobile applications, visually impaired visitors can independently explore exhibits and places of cultural interest safely and enjoy realtime descriptions. Through technologies such as image sensing and tracking, location, and simultaneous mapping, physical spaces can be augmented both visually as well as through other sensory modalities such as touch and hearing . Auditory virtual tags affixed to objects in museum spaces can be activated based on the proximity between the object and the user's mobile device, providing users with information related to the context and characteristics of the work .\nAs for people with physical disabilities, another way to ensure their accessibility to museum content is by using VR to create a virtual environment and tours. Virtual environments allow navigating within a space and interacting with people in different places . People with disabilities can encounter cultural experiences in VR and AR settings, improving the impression of \"being there\" or \"feeling present\" in a given space . Different studies show that virtual visits are an excellent tool for people with disabilities allowing them to access and appreciate works of art . In this context, terrific and yet unexplored opportunities can be offered by the virtual spaces that can provide the possibility of entering and visiting virtual galleries in a realistic and highly immersive way without having to travel miles to reach a physical museum or to enjoy an art exhibition or archaeological site.\nAnother opportunity presented by AI solutions is the creation of engaging cultural experiences that support audience development and promotional goals by enabling the creation of content and activities that can be customized to different types of visitors. Immersive technologies can significantly enhance the visitor experience by engaging users in the museum environment. With speech recognition technology and interactive question-and-answer apps combining AR and VR, visitors can interact with virtual characters that can explain and interpret cultural content that emotionally engages them . In this approach, engaging and interactive storytelling can overcome those communication barriers that often prevent art from raising the audience's interest. Using automated planning systems, AI can also create personalized visit itineraries that consider users' preferences. Cultural trails can be customized to suit the preferences and interests of tourists using multimedia tools like a user-friendly app. These systems may increase interest in and demand for museum exhibits and cultural activities. Based on the information entered, the planner develops a tailored path and suggests it to the users, selecting artworks that match their preferences and excluding those that do not .\nAnother benefit AI can bring to the cultural sector, in improving accessibility, is the automatic description and interpretation of artworks. AI algorithms can automatically describe, and catalog works of art. In this way, through high-performance computing (HPC), trained AI models, can significantly improve the information on cultural heritage . To achieve this, tens of thousands of images and text descriptions are used to train a DL model for automatic data labelling. As a result, it is possible to automatically generate descriptions that consider culture, symbolism, and historical context for thousands of cultural heritage archives. The richness of the annotation enables a better browsing experience in collections catalogs and better access to collections. These results can support education, art, and tourism but also scholarly and research activities.\nThese applications bring significant social benefits: through greater inclusion and accessibility, it is possible to achieve greater democratization of art and culture, leading to a more culturally and artistically informed, sensitive, and aware society."
    },
    {
      "title": "Improved Preservation Practices",
      "content": "Natural and human-made challenges such as climate change, natural disasters, conflict, and vandalism have made preserving tangible cultural heritage an increasingly complex challenge to face in the last decades. In this scenario, AI-based technological developments have completely changed how cultural heritage can be preserved and documented, addressing and mitigating damages while improving security measures. As Ocón states \"Digitalization can also provide a sort of memory insurance policy for cultural heritage, in the event of a total or partial destruction, or substantial degradation\" . There are many examples of how, thanks to 3D modeling techniques, destroyed monuments have been revived. AI technologies, for instance, brought back to life Buddhas, which were destroyed in Afghan Bamiyan Valley in 2001, as holographic statues . In a similar vein, the UNESCO-sponsored initiative \"Revive the Spirit of Mosul\" has been successful in using 3D modeling to restore monuments that were destroyed during the numerous conflicts that decimated the millennium-old city of Mosul . Modern 3D scanning tools and AI algorithms allowed for the mapping of the damage and the planning of the reconstruction of Notre Dame Cathedral in Paris after the catastrophic fire that occurred there in 2019 . In this regard, another great opportunity AI offers to the art field is the capacity to determine the authorship of a painting based on various stylistic characteristics. This makes it possible to solve problems of attribution of artworks avoiding the distribution of paintings with false authorship on the art market. Thanks to DL-based technologies, it is possible to identify a piece's author, context, and period, addressing attribution and interpretation disputes. Art specialists often employ attribution techniques that rely on identifying the unique visual characteristics of paintings, honing their skills by analyzing numerous artworks. In a similar vein, Convolutional Neural Networks (CNNs) are adept at detecting the distinct qualities that capture an artist's unique style. By training CNNs on a large digital collection of art, these networks can discern artist-specific visual traits crucial for reliable attribution . While object recognition might seem straightforward to humans, pinpointing an artist's style and correctly attributing artworks remains a complex task, even for experts. In contrast, deep learning algorithms have shown remarkable accuracy in attributing art quickly and effectively. This technology significantly aids decision-making in museums, auction houses, and among art collectors, providing a robust means to verify the authenticity of artworks in the market.\nAnother problem that often arises in the restoration of works of art is the complete reconstruction of the artwork when some parts are missing or significantly damaged. In this sense, AI has tremendously aided the study of cultural heritage, notably in automatic object recognition and the translation of ancient languages, where DL algorithms can be used to fill in the gaps in damaged or only partially restored old texts . Moreover, Generative Adversarial Networks (GANs) and DL algorithms broadly have recreated damaged images. These AI models could help conservators and restorers recover frescoes when pieces are damaged or missing .\nAI technologies can also evaluate and understand vast quantities of geospatial and historical data, providing crucial details about cultural heritage sites and artifacts . This process can offer information for conservation and maintenance efforts aiding decision-making processes in this regard. AI systems can also assist in creating digital cultural heritage models, supporting accurate simulations and reconstructions. For example, in detecting and mapping archaeological sites and other cultural heritage assets, ML techniques are utilized to analyze and interpret the 3D point cloud data produced by LiDAR sensors , . Additionally, AI can automate 3D digitization processes, making the procedure time and cost effective, and allowing cultural heritage to be more widely accessible . Indeed, AI-powered virtual reconstruction and restoration enable precise and thorough recreations of historical sites and artifacts, providing visitors and researchers with immersive experiences. AI can contribute to the preservation and transmission of cultural heritage by also offering innovative strategies for protecting our shared history and cultural heritage for future generations . The structural condition of cultural heritage can also be tracked using AIbased visual inspection systems, in which ML algorithms analyze visual data from sensors and cameras to identify and detect potential structural damage or deterioration quickly and accurately. In this way, AI could track and detect changes to cultural heritage sites and artifacts for damage prevention and in-time intervention. AI-assisted risk and emergency scenario prediction can help to safeguard cultural heritage from upcoming catastrophes like natural disasters or vandalism . AI can also help recover historical property, enabling the identification and restitution of stolen or illegally sold cultural heritage items. In addition, AI can be employed for online crime heritage detection to spot and stop unlawful trading in cultural heritage artifacts ."
    },
    {
      "title": "Novel Forms of Creative Production",
      "content": "Thanks to generative AI based on GANs, it is now possible to create pieces of painting, music, or literary text using AI. In this way, artists can be assisted in creating new creative languages, leading to a collaborative relationship between AI and human agency and creativity. With the advent of generative AI platforms such as those from OpenAI, Mistral, Google AI, and Anthropic, pretrained algorithms and foundation models that can create creative and artistic content are becoming easily accessible to everyone. With tools such as DALL-E, Claude AI, Suno, Character.ai, Midjourney, or SORA, it is possible to create and conceptualize a work of art through a prompt, which is a text-based input describing the image to be created. While many criticize generative AI tools as automation tool of artistic production, more optimistic perspectives argue that they might create an opportunity rather than a threat .\nThe invention of photography was also criticized at its origin as the end of visual art. However, history has demonstrated that this was not the case: photography has offered the opportunity to move on to new artistic languages that have broken away from realism . In this context, AI can be considered a new technological medium that can shape, enrich, and expand the artistic languages we knew to date."
    },
    {
      "title": "AI IN CULTURAL HERITAGE: ETHICAL CHALLENGES AND RISKS",
      "content": "Despite the tremendous opportunities AI offers the cultural sector, it can simultaneously pose several ethical challenges and risks. In this section, we identify at least eight critical ethical risks that should be considered for the responsible and trustworthy use of AI in cultural heritage. These risks were identified by analyzing the applications of AI in cultural heritage through ethical lenses resulting mainly from the reasoned matching of the ICOM Code of Ethics (a reference text that sets standards for the practice of museum professionals) , the EU ethical guidelines for trustworthy AI , the Recommendation on the Ethics of Artificial Intelligence promoted by UNESCO, and a preliminary sector-specific framework designed for the ethical use of AI in cultural heritage ."
    },
    {
      "title": "Undermined Authenticity",
      "content": "Various cultural organizations worldwide, including the International Council of Museums (ICOM), the International Federation of Library Associations (IFLA), and the International Council of Archives (ICA), have codes of ethics that aim to guarantee authenticity. UNESCO also fully promotes authenticity through the notion of \"Outstanding Universal Value\", which is the threshold for including a cultural heritage property in the World Heritage List . Despite that, Nakonieczna and Szczepański (2023) defined authenticity as \"an ephemeral phenomenon\" . They state that \"depending on the ideology, the perception of authenticity can be quite diversified, even mutually exclusive\" . Regarding the digitization of cultural heritage, authenticity is a hotly contested topic. When referring to \"authenticity\", the original artwork's substance is emphasized as the sole source of verifiable historical evidence and a connection to the artist . Some contend that interactive 3D reproduction does not accurately depict the original and may even dehumanize cultural heritage . Various authors have long debated and addressed the issue of art authenticity. Indeed, it is frequently believed that a piece of art is unique and capable of inspiring an \"aura\" that is, a poetic and political gaze in the observer, and that any reproduction will not be able to substitute for the physical experience of the \"hic et nunc\" (here and now feeling) . While AI provides new tools to make art more engaging through AR and VR, one can contend that since VR is a medium to access art, it can weaken or decrease the authenticity of the original artistic space and experience. Replacing physical with virtual contact could lead to a sort of communicative and relational impoverishment that would jeopardize the fulfillment of the educational goals of cultural heritage. Those who claim such risk maintain that museum experiences require personal, social, relational, or strictly physical interaction to increase heritage objects and sites' intrinsic enjoyment and engagement . In this sense it is critical that VR experiences, and thus the AI they depend on for dynamic content generation and optimization, are designed to be highly believable, facilitating interaction and navigability . Some of these issues arise in the case of real-time rendering, a crucial aspect of many VR experiences that impose limitations on the complexity and richness of visual details. This constraint can affect artists who rely on intricate details to convey their artistic vision. A digital sculptor creating highly detailed virtual sculptures may face compromises in visual fidelity due to the real-time rendering demands of VR, potentially impacting the level of detail and nuance in the final piece. In this way, the authenticity of the artwork experience and the message they convey risk being compromised.\nThe problem of authenticity also affects AI-generated works. If the authenticity of a work of art is based on a poetic relationship between the viewer and the artist, the question naturally arises as to whether this relationship can also be established with a machine-generated piece based on yet-existing artistic training images. Since the authenticity of a work of art is closely linked with its authorship and provenance, a few key questions arise and will have to be answered though valid arguments in the case of AI-generated art in the near future: Who is the author? Can that work, created by a machine, be said to be authentic?\nAnother challenge with regard to authenticity is posed by AI automated planning systems that create cultural offerings tailored to consumer tastes and preferences, therefore undermining the educational task of cultural institutions. By offering just what appeals to audiences (popular contents), while potentially omitting less popular and mainstreaming artworks, this technology can diminish the provocative and critical power of the arts, it could also undermine the heterogeneity in creative production leading to more impactful and greater aesthetic standardization.\nTo prevent this challenge, artists must avoid ceding to content impoverishment actions in the light of a simpler, more engaging, and accessible experience, by working on preserving their intended narrative and meaning while generating viewer engagement. This entails a careful ethical consideration to not let the emphasis on creating an engaging and often standardized or mainstream experience compromise or dilute the unorthodox, unexpected, and sometimes disturbing effect very often invaluably connoting or characterizing artistic expressions.\nIn summary, preserving cultural heritage authenticity is a significant and necessary ethical problem to address. As Nakonieczna & Szczepański (2023) point out, the concept of \"Authenticity of cultural heritage\" has evolved over time and now needs a paradigm shift, a redefinition of this concept, taking into account the new technologies that are revolutionizing how the artistic experience is enjoyed: they do not mediate it anymore, while deeply influence and shape it . To the best of our knowledge, no current AI ethics framework considers this requirement to be of utmost significance. Therefore, it is today of paramount importance to define the authenticity of a work of art (what it means and requires to be ensured) and include this core ethical value and principle within a sectorspecific ethical framework for ethical AI in cultural heritage."
    },
    {
      "title": "Inaccurate Interpretation of the Artwork",
      "content": "The issue of inaccurate automatic interpretation of the artwork fits into broader ethical framework principles, particularly in the issue related to the accountability of AI systems. According to UNESCO's Recommendation on AI ethics , AI systems ought to incorporate methods for oversight, impact assessment, verification, and due diligence to maintain AI accountability. For this reason, a preliminary sector-specific Ethical Framework entails reliability as a fundamental ethical principle for using AI in the cultural heritage context . The latter framework stresses how the ethical requirement of Human Agency and Oversight (see HLEG-AI 201) becomes crucial to address accountability of AI in cultural heritage, which always requires the cultural heritage expert in the loop. In particular, argues how human agency can tackle one of the main obstacles to using AI for the automatic description and cataloging of works: the quality and quantity of data required and available to train AI models . Training an automatic captioning model requires a dataset with corresponding images and descriptions. Cultural heritage metadata usually does not refer to the visual content of the artwork that, by contrast, is crucial to formulate a complete analysis of the work. In addition, a highly symbolic component characterizes a work of art: the same element may have different meanings depending on the artistic movement to which it belongs or the historical period of reference. For this reason, the dataset's annotation phase is of paramount importance. Thus, if the descriptions used to train the model are incomplete, there is a risk of transmitting an inaccurate description to the end user. Consequently, omitting critical artwork features might change its social, cultural, and artistic meaning. An example of a risk that may occur is that an AI algorithm may misinterpret the symbolism in a painting, associating an ordinary object with a particular meaning that the artist does not intend-for instance, interpreting a butterfly as a symbol of freedom when the artist intended it to represent fragility. Another problem may arise in the automatic interpretation of conceptual art, which often relies on ideas and contexts rather than traditional artistic elements. AI may struggle to interpret and appreciate an artwork's conceptual nature, resulting in a superficial analysis that misses the deeper meaning. For this reason, to be reliable, the development of automatic captioning systems for describing works of art requires extensive annotation of datasets related to archives and catalogs, which can be done only and exclusively by domain experts such as art historians, archaeologists, linguists, and philologists. Here the role of human agency and oversight as a requirement becomes clearer. It is worth specifying that the choice of such experts is also important. The lack of representation and cultural diversity (also in terms of artistic influences, backgrounds, ethnicity, age, and gender) might lead to another kind of risk and ethical challenges, belonging to the category of biased interpretation."
    },
    {
      "title": "Biased Interpretation",
      "content": "Diversity and nondiscrimination are two fundamental ethical requirements outlined in the UNESCO recommendations for using AI and the EC Guidelines for Trustworthy AI . These high-level requirements arise from the general AI ethics principle of justice and fairness, present in almost every framework developed to date for AI . These requirements must be considered when applying AI in cultural heritage, for example, to automatically interpreted works, in order to avoid the risk of culturally limited or biased interpretations. Although experts often try to define objective criteria for reading works of art, interpretations often vary according to the cultural and epistemic background of the art critics.\nOne might question the importance of interpretation. Indeed, according to Susan Sontag \"Interpretation is not an absolute value [• • • ] Interpretation must itself be evaluated, within a historical view of human consciousness. In some cultural contexts, interpretation is a liberating act [• • • ]. In other cultural contexts, it is reactionary, impertinent, cowardly, stifling\" [42, p. 4]. In this definition of interpretation, highly subjective aspects indeed emerge; aspects that vary according to diverse personal encounters people can have with art. For this reason, in criticism, as in art, there are many currents of thought, each with its own particularities and different readings.\nWhen the interpretation of a work is made through AI models, the choice inevitably falls on the most dominant and accessible via data reading of the work (informativeness bias). In this way, only the most popular interpretation is transmitted and communicated, often leading to a culturalhistorical bias and the marginalization of less dominant, but no less significant, interpretations and hence understanding . This happen especially in interpreting the cultural heritage of minorities such as indigenous communities or communities with a colonial heritage, which tend to be vulnerable to be improperly influenced and read by ethnocentric, Western-centric lenses . In the attempts to assimilate indigenous knowledge and spirituality into a \"Western\" worldview interpreting cultural heritage metadata in such a way risk undermining local cultures' veracity . Particularly, this risk mainly occurs when AI models are trained on datasets that reflect biases prevalent in historical art collections or among critics. This challenge can lead to a skewed understanding of art history, reinforcing stereotypes, as well as overlooking contributions from marginalized groups. Also, there is a risk of underrepresentation of diverse perspectives: If the training data lacks diversity in terms of artists' backgrounds, styles, or cultural influences, the AI model may struggle to interpret artworks that deviate from the dominant narratives present in the training data. High-level ethical principles and requirements of diversity, fairness, and nondiscrimination are violated in these situations , . The automatic interpretation of works thus runs the risk of failing to reflect minorities while flattening multiple readings of a work. Therefore, the inability of AI to reflect all the different and myriad interpretations of a work become a relevant challenge to consider.\nIn this context, as some authors have started to observe, it is critically important to deeply expand and revise (decolonize) core AI ethics principles by considering also other cultures besides the Western to develop truly representative ethical systems of values to embed in AI . The ethical frameworks characterized by principles and values that guide AI ethics run the risk of being biased by the vision of Western moral philosophy; that is, they risk failing to consider ethical perspectives belonging to other, more marginalized, and vulnerable cultures (e.g., Ubuntu ethics in Sub-Saharan Africa), which deserve equal attention for a globally sensitive AI ethics discourse . Similarly, the application of AI in cultural heritage faces the risk of becoming a channel for perpetuating patterns of colonialism. For this reason, the ethics of AI for cultural heritage must move beyond the widely acknowledged risks such as privacy and autonomy issues to consider AI's role through cultural heritage in nurturing forms of colonialism . In this scenario, it is possible to identify two major ethical issues: The first concerns risk of cultural identity erasure of minorities resulting from the failure to consider cultural heritage's multiple cultural and semantic facets. Data abstraction processes, i.e., the ability to automatically provide a semantic characterization of data , can cause this risk, implementing data simplification procedures and subsequent generalization of details. The second issue entails that a globally sensitive and inclusive ethics of AI for cultural heritage requires the decolonization of cultural consumption. That is, it is necessary to conceive cultural heritage as something created by and for the target communities, and consequently, it is only through their reading, customs, and traditions that it must be interpreted and enjoyed. On the contrary, if this effort is missing, the application of AI will lead to a cultural heritage's innovative fruition. Still, only in terms of the medium and not in terms of content: in fact, it will only replicate the patterns of cultural reproduction, appropriation, and exploitation already in place."
    },
    {
      "title": "Digitization as an Excuse to Destruction",
      "content": "Another principle common to the EC guidelines and UNESCO recommendations is sustainability of AI , , intended as societal and environmental wellbeing. That is, there is a need for AI to consider the protection of the environment, the natural ecosystem, and biodiversity and contribute to more just and fair societies . For this reason, AI should be used in a way that succeeds in reducing its energy consumption, which is often directly proportional to its performance levels. Also, it should be used to support innovative reconstruction and restoration systems. This principle aims to limit the risk associated with digitization and subsequent virtual reproduction of artworks: the possibility that digital representation will supersede the significance of the physical one, justifying the destruction of certain physical cultural heritage sites and artifacts that are of historical and cultural significance to local communities while not on the World Heritage List -therefore not protected by relevant legislation. For example, accurate 3D modeling and reproductions that allow digital access to cultural heritage can justify interventions to demolish it to construct new structures for purely economic and commercial purposes. In the face of this risk, Ocón examines the challenges that Southeast Asian cities faced in balancing the preservation of unprotected cultural heritage with urban development needs. In particular, the author highlights how digital archiving, 3D modeling, and VR have been used to document and virtually preserve precarious sites such as The Bukit Brown Cemetery in Singapore and the Pekeliling Flats and A&W Petaling Jaya in Malaysia before they were altered or demolished.\nWhile these technologies have been crucial for conserving these sites, it is important to also consider the risks of relying solely on digital preservation. Using digital methods as justification for the physical destruction of cultural heritage could result in the loss of tangible elements that often hold significant identity value for the reference group.\nIn addition, the application of AI in cultural heritage entails significant human and environmental costs that frequently conflict with cultural heritage's social and ecological sustainability goals . For example, the development of AI systems requires the occupancy of space (e.g., data centers), technological infrastructure, and environmental resources, which can adversely affect areas that are crucial for the preservation and well-being of specific historical, natural and cultural sites, potentially degrading these environments and diminishing their historical and cultural value."
    },
    {
      "title": "Socio-Economic and Cognitive Accessibility",
      "content": "Building on the core AI ethics principle of justice and fairness, the sector-specific framework developed for using AI in the cultural heritage context recognizes accessibility as a fundamental principle . Indeed, it is essential to ensure equal possibilities of access to and enjoyment of these technologies independently of different kinds of institutions and audiences. As echoed in the UNESCO recommendations, spreading awareness and literacy of these technologies to domain experts and target audiences is crucial to making these technologies accessible to all .\nTo further address these challenges, it is imperative to also consider the provision of adequate economic and educational resources. Developing AI models to promote and sustain cultural heritage requires significant economic investment and mainly specialized human resources . As a result, there is a risk of disparities between larger and wealthier institutions that can afford to make significant investments and smaller institutions with niche productions that cannot bear the high costs. Similarly, because of the high investment required to develop such technologies, there is a risk that cultural heritage of economically weaker countries will be excluded from the digitization process . The risk of unfairness and discrimination related to the need for significant economic resources to develop AI systems, occurs when only wealthier and more developed countries can afford AI technologies to preserve and restore their cultural heritage. In contrast, economically disadvantaged countries are likely to be left behind and find the process of reconstruction, preservation and accessibility improvement challenging to implement, leading to a distinction between \"A-list cultural heritages\" and \"B-list cultural heritages\"\nAnother problem is the cognitive accessibility of digital content. Digitization allows better access to cultural heritage, even for people with physical disabilities. For people with cognitive disabilities, there is a risk that these processes will marginalize them even more . Indeed, it is essential to ensure that the digitization of cultural heritage does not result as an end in itself, but that digitalized artworks, services, and experiences are also cognitively accessible and enjoyable by the target audience. For this reason, once access to digital collections has been enabled or immersive experiences have been developed through AR and VR, it is also essential to ensure that these products and content are consciously consumed. To this end, it is essential to design these products considering the nature and source of potential users' cognitive vulnerabilities to develop interfaces that compensate for, rather than exacerbate, such imbalances or diversities (e.g., neurodiversity).\nFor instance, the target audience may lack the necessary training to utilize AI technologies appropriately, which creates an additional barrier. This risk is especially significant when enhancing the cultural heritage experience by making it more personalized and inclusive. Without a proper understanding of how to interact with AI-driven tools, users may feel frustrated, incapable, or confused, and even excluded by design. It may also ruin their overall experience and potentially discourage them from further exploring AI-enhanced cultural content.\nAdditionally, AI applications often require understanding complex interfaces or interpreting AI-generated recommendations. Untrained users may find these aspects challenging, leading to misuse or underutilize AI tools. Furthermore, without proper or personalized training, people with disabilities or older adults may find it particularly difficult to use AI technologies, limiting their access to art and cultural education. These are just a few examples of risks that can occur. Therefore, as outlined in the UNESCO recommendations, the development of AI systems must be accompanied by processes of education and literacy about how these technologies work by improving their accessibility."
    },
    {
      "title": "Universal Access and Top-Down Approach",
      "content": "One of the sector-specific principles developed for AI in cultural heritage is meaningful participation. This prescribes that the use of AI technologies should be implemented in an inclusive manner through a bottom-up approach involving different stakeholders and competencies .\nMany contend that cultural heritage digitization is frequently adopted top-down and as a means rather than an aim, omitting several vital aspects of the community's needs. As Taylor and Gibson (2016) argue \"certain digitization activities can subtly reinforce non-democratic structures\" . For example, this might be the case of digitizing the cultural heritage of indigenous communities. This would ask for both hearing and centering their voices and considering the consequences that such operation (i.e., the resulting free access to that heritage) would bring to the target community. The target communities conceive some cultural sites as sacred or symbolic, and their access is allowed only to people of a specific gender or age. For this reason, there is a risk that the digital reproduction of a cultural heritage site and its resulting free access will not align with the worldview of the target communities. Neglecting communities' needs and values reinforces different forms of discrimination . Consequently, these risks are at odds with the commitment of cultural institutions to present a variety of perspectives and to promote cultural diversity and mutual dialogue between cultures , as well as with the ethical principles of fairness, equity and nondiscrimination promoted by the general EU and UNESCO recommendations , . Moreover, the involvement of communities' members might help overcome the risk of excluding them from benefiting from AI's economic and cultural opportunity in cultural heritage without violating its sacred and identity value.\nFor some communities, cultural heritage has sacred value, and using disruptive technologies such as AI to enjoy this heritage could be a form of heresy. To respond to this risk, it becomes necessary to introduce an additional domain-specific ethical principle: dignity, i.e., the need to ensure the respectful preservation of culturally sensitive material, such as material of sacred, identity significance, and its intrinsically human nature . For this reason, it is desirable to engage in an open dialogue with the communities that live the cultural heritage to represent it in a manner consistent with their customs and traditions."
    },
    {
      "title": "Responsibility Attribution for Actions and Decisions Based on AI Outcomes",
      "content": "According to the EU guidelines, explainability is another essential principle and condition for trustworthy AI . The need for explainable AI is associated with the risk of a black box effect. Indeed, the better AI performs, the more difficult it is to explain the solutions provided by such models. However, since cultural heritage is a common good and an expression of the values of the relevant community, the solutions and decisions on cultural heritage obtained by AI models should be explainable to defend AI-based results with a rational explanation that non-technical users, including audiences and communities, can understand. For example, AI can significantly support restoration practices, reconstructing missing parts of frescoes or old damaged buildings. However, if one cannot explain why the AI arrived at that solution, it is difficult to assess if that solution is flawed or trustworthy. Most importantly, if that decision proves to be incorrect, it would become hard to determine who is responsible for the resulting consequences and changes on the cultural heritage. The complexity arises from the involvement of multiple actors in AI systems, including system designers, software producers, and relevant data providers. Moreover, assigning responsibility is further complicated by AI systems' ability to autonomously modify themselves (self-adapt) based on the processing of new data or their continuous interaction with their environment. This lack of accountability risks damaging invaluable cultural assets and undermines public trust in AI applications within this sensitive field.\nFor this reason, explainability is a key pro-ethical condition for assessing and distributing responsibility. Indeed, one of the most significant ethical challenges is the need for an understanding of who is responsible for decisions made based on the results processed by AI systems. Assigning responsibility for decisions based on results derived by AI systems is a highly debated topic in several areas of AI application, such as healthcare and justice. However, the use of AI in the cultural sector still needs to be better considered. Regardless of the extent to which AI is used in cultural heritage preservation practice, it is essential to clarify who bears responsibility for decisions based on algorithms' results, predominantly when those decisions cause harm or lead to adverse or incorrect outcomes. It is essential to define whether the algorithms can be considered, to some extent, agents or whether the responsibility for their decisions lies only with individuals such as developers, computer scientists, or end users such as art historians and archaeologists . Given the risks listed above and knowing that AI systems, as well as human intelligence can fail, it is vital to recognize those responsibilities when such threats occur working on this issue ex ante. Specifically, determining who is responsible for situations such as the misreading or misinterpretation of a work of art, the failure of a sensor to monitor the deterioration of cultural heritage resulting in its damage, or the incorrect cataloging of a work of art, is crucial for a reliable and trustworthy use of AI in cultural heritage. In addition, decisions based on AI algorithms can also result in economic injuries to buyers and sellers in the art market, such as in the case of misattribution of the work. The issue of allocating responsibility is also strictly linked to the new challenge in AI-generated contexts of attributing authorship for art images and products especially in cases of copyright infringements. For example, the question of who can be held responsible for copyright infringement of a work used by the AI system as a training image to create the AI-generated creative content must be clarified by design. We expand this challenge in the next section."
    },
    {
      "title": "A New Concept of Authorship",
      "content": "Further concerns to consider are today widely related to the so-called rise of Generative AI which makes it possible to create realistic art products such as poetic texts, melodies, or paintings . As previously outlined Generative AI produces creative content using training data from existing art media . Despite the opportunities Generative AI can bring to art and creativity we outlined above, it also poses significant sector-specific issues related to the determination of authorship such as the risk of copyright infringement and the challenge of the creative industry to ensure fairness in the labor market . Since generative AI produces creative results by training on existing images often copyrighted and part of cultural heritage, copyright infringement can frequently occur. In particular, the final outputs could be considered derivative works for which the original artists could claim authorship, at least jointly . If, on the one hand, there is a risk of alleged copyright infringement of the training images, there is also the challenge of determining authorship of the new creative work created by Generative AI. Therefore, the question arises about who has the right of authorship to a creative output achieved by generative AI. Indeed, text-to-image systems underlie the creation of artistic images using generative AI. Tools such as Midjourney, DALL-E, and SORA work effectively when the prompts used are specific and well-written , . This has given rise to a new research area called \"prompt engineering,\" where it is essential to determine the extent to which the right of authorship rests with the prompt engineer, the AI system, or its developers. The importance of establishing the authorship of the work lies in the primary purpose of copyright law, which is to promote creative production as a social practice to support the dialogue between the viewer and the artist, who has a political role in society . From this aspect arises the question of authenticity. Suppose only art that serves as a medium for poetic dialogue between artist and viewer, that is, between two human beings, is understood as authentic. In that case, understanding the author of an AI-generated work with which the viewer enters a dialogue is of utmost importance to assess AI-generated artworks' authenticity. Consequently, resolving the work's authorship dilemma is fundamental to defining its authenticity.\nFinally, linked to this aspect, generative AI poses a significant challenge to the future of the cultural heritage labor market . Indeed, suppose authorship of AI-generated works rests with a computer. In that case, this will bring the risk of technological substitution not only for repetitive jobs that follow explainable processes but also work requiring more creativity or domain expertise. For this reason, these systems have begun to worry professional groups such as composers, designers, and writers who, until a few years ago, saw their jobs at low risk of technological substitution because creativity is a process that is traditionally human, to date not easily codifiable in concrete rules .\nFurthermore, those in the industry who cannot use these tools due to a lack of technical skills will inevitably be unable to benefit from their opportunities. In this scenario, generative AI challenges the role of humans as creative agents in society , risking delegating to algorithms even the most human of capabilities, namely creativity and invention. Consequently, human creativity, imagination, and even divergence from AI logic might be channeled and discouraged.\nIV. CALL TO ACTION While many ethical issues related to the use of AI in the cultural heritage field fit within broader AI ethics frameworks, challenges emerge in the cultural heritage field that do not precisely fit within existing ethical frameworks. Aspects such as authenticity, dignity, shared responsibility, and meaningful participation are unique in their kind and specific application of AI in the cultural context. Hence, our call to action is to consider the risks and opportunities we discussed in order to manifest the urgency of a sector-specific, actionable ethical guidelines for using AI in cultural heritage.\nGiven the great amount of possibilities AI offers to cultural sectors, it is necessary to promote its conscious development while considering the risks and ethical challenges that its application may entail in a field, namely that of cultural heritage, which until recently was the exclusive domain of human beings.\nDespite the significant efforts of actors such as UNESCO with its Recommendations on the Ethics of AI , these guidelines provide only the high-level groundwork for determining the requirements that AI technologies should meet to ensure their trustworthy use in the field of cultural heritage. Considering the specific ethical risks and sensitive issues identified above for AI in cultural heritage, these guidelines need to be further developed in a context-sensitive way to be truly effective and actionable in this field. This section will contribute to pave the way in this direction by highlighting the areas that need research and work to create a sectorspecific ethical and policy compass and regulation. For each area of work, we define also the involved stakeholders. It is worth outlining that a few of the pathways we propose are more actionable in the near future (e.g., establishing criteria for authenticity through consensus votis among experts and stakeholders), while others require further time and effort due to their complex nature (e.g., to define the authorship of AIgenerated works of art as it required knowledge of data input and training of the systems that are often opaque).\nFirst, the conditions under which AI technologies do not compromise the authenticity of the artistic experience must be identified. Furthermore, it is crucial to reformulate the concept of artistic authenticity and the criteria for determining what is authentic in light of the incursion of AI in cultural heritage. Moreover, it is essential to define the criteria under which digitization makes the artistic experience more accessible and comprehensive while retaining the centrality of the physical artwork. In other words, it is crucial to understand in which conditions digital artistic experience can undermine cultural heritage's authenticity, leading to substituting the physical one. To work on this aspect, the contribution of experts in the field, such as art historians, cultural mediators, and aesthetics, who can define the boundaries within which the artistic experience retains its authenticity, is essential.\nSecond, it is necessary to develop greater literacy regarding AI and digitization processes so that it does not remain the exclusive preserve of a highly educated and elitist audience. For this reason, it is essential to introduce digital and computer science skills at all levels of education, from elementary school to higher levels. Redesigning educational systems with interdisciplinary capabilities offers the opportunity to combine artistic skills with cutting-edge technological solutions. To ensure the preservation of cultural heritage and encourage innovation and creativity, a collaborative approach between AI and professionals in the field is necessary, rather than viewing them as mutually exclusive. That would be possible through education, the acquisition of innovative skills, and greater awareness of how AI tools work. Only in this way AI can become a beneficial tool rather than a harmful substitute. Better education and a greater understanding of how AI works will help develop systems that foster creative human agency rather than replace or undermine it. Working on these goals necessitates the involvement of technologists and technical experts who define the minimum requirements for the informed use of these technologies to spread. Their involvement needs to arise from national and international institutional actors (e.g., UNESCO or Committee on Culture and Education (CULT)), defining new education policies based on an understanding of how technologies work, which would ensure a more informed and conscious use of them. Furthermore, AI systems must ensure justice as fairness and nondiscrimination when applied to cultural heritage. For this reason, in a living heritage context, the needs and cultural values of the local community must be respected and considered. Therefore, it is necessary to develop workflows to implement digitization projects with a bottom-up approach, starting from the needs of the population stewarding cultural heritage. In other words, defining criteria for evaluating digitization actions based on a community-based approach is essential. In line with the recommendations of UNESCO, a multi-stakeholder approach must be adopted, to ensure the centrality of the reference group . In particular, the cultural sector's public, private, and nonprofit stakeholders are called upon. This line of effort is undoubtedly the most complex, requiring more significant commitment. The needs of the local community change depending on the area in which it operates, so the definition of general reference standards requires a noteworthy collective and collaborative effort. Moreover, needs and preferences also change over time, hence, ongoing monitoring and revision may also be needed.\nFinally, further work needs to be done on the legal side. According to EC Ethical Guidelines for a trustworthy AI, to be deemed trustworthy, AI systems should meet the requirement of accountability . This means that, on the one hand, clear regulations must be developed for algorithms' accountability. On the other hand, appropriate redress and compensation mechanisms must be defined in case of harm or dangerous outcomes, for example, when a cultural heritage site is damaged, mining the history and memory of a community, when a misattribution of a work of art causes economic harm to the owner or buyer, or in case of incorrect interpretation or cataloging. In addition, an international copyright law update that protects artists' rights and their works from copyright infringement by generative AI is particularly urgent. Furthermore, it is necessary to clearly define whether AIgenerated creative works can be considered artistic expressions and, if so, who owns their authorship. In this case, the scientific community and governments are called upon to reflect and develop new regulations and a unified perspective to provide legal clarity on this issue."
    },
    {
      "title": "CONCLUSION",
      "content": "This article attempted to shed light on the potential of AI for the promotion and preservation of cultural heritage considering the ethical implications that these applications may have, such as the loss of authenticity of the artwork, the attribution of responsibility for decisions based on the results of algorithms, the risk of discrimination against minorities, the implications related to universal access to cultural heritage and, finally, the issue of authorship and the role of the artist in our society. AI has proven to be able to enter every aspect of our existence, and it is doing so in an increasingly rapid and high-performance manner, making it difficult for institutions to respond promptly to the diversity of challenges that arise with this technology. The importance of this work lies in its call for institutions, the scientific community, and experts in the field to action for establishing specific criteria and standards that go beyond the generalist approach of the guidelines that have existed to date and develop clear and specific industry guidelines for harnessing AI's benefits and preventing its risks for cultural heritage, thereby promoting an informed use of these technologies without jeopardizing the positive social impact of art and culture. Aware that so much work needs to be done in this direction, we hope our study will pave the way for further multidisciplinary and multi-stakeholder efforts, involving professionals from different sectors -from art historians to archaeologists, from computer scientists to jurists -in the field of ethical AI for cultural heritage, as far as necessary to improve a relational, mutually flourishing approach between AI agency and human agency and creativity. She is an expert in the field of applied ethics with a particular focus on digital ethics and ethics of AI. She is also a Co-Founder of GAIA srl (AI Ethics and Governance), innovative start-up and university spin off focused on the ethicallegal assessment of AI solutions and AI Ethics advisor for companies in Europe and U.S. On these topics, she authored two books and a significant number of articles in leading scientific journals (AI and Society, Science and Engineering Ethics, and Ethics and Information Technology), and she delivered more than 60 talks in academic institutions, such as Harvard University, Tufts University, Toronto University, and many more in Europe, Canada, and U.S."
    },
    {
      "title": "Section",
      "content": "Sofia Pansoni is currently pursuing the Ph.D. degree with the Department of Political and Communication Science and International relationship, University of Macerata. She graduated in Economics and Management for Arts, Culture, Media, and Entertainment with a focus on art markets, heritage, and culture. She has always been interested in multidisciplinary solutions that combine management with technological innovation for the promotion and economic sustainability of arts and culture. During her professional experience, she gave the opportunity to advocate for the digitization and promotion of cultural heritage, collaborating with cultural and research institutions. During these years, she has worked in the field of digital marketing, analyzing data, researching, and applying digital tools to improve the promotion and communication of the creative and non-profit industries.\nEmanuele Frontoni is a Full Professor of Computer Science with the University of Macerata and the Co-Director of the VRAI Vision Robotics and Artificial Intelligence Lab. His research interests include computer vision and artificial intelligence with applications in robotics, video analysis, human behavior analysis, extended reality, and digital humanities, with a specific focus on AI for cultural heritage. He has published extensively on topics, such as augmented reality, point cloud semantic segmentation, and the use of AI for the preservation and interpretation of cultural assets. His work bridges advanced AI techniques with practical applications in the cultural sector. He is also involved in several national and international technology transfer projects in the fields of AI, deep learning, data interoperability, cloud-based technologies, and big multimedia data analysis, extended reality, and digital humanities.\nDr. Frontoni is a member of the European Association for Artificial Intelligence, the European AI Alliance, and the International Association for Pattern Recognition.\nBenedetta Giovanola holds the Jean Monnet Chair Ethics for inclusive digital Europe co-funded by the European Union, and is a Full Professor of Moral Philosophy with the University of Macerata, Italy, where she has also been the deputy rector and a vice-rector for international relations. She is a regular Visiting Professor with Tufts University and previously held visiting positions with UIBE, Beijing, and KU Leuven, and was a Huygens Fellow with Radboud University Nijmegen. She is the Vice-President of the Italian Association of Moral Philosophy and a Past Member of the Executive Board of the Italian Association of Analytic Philosophy. She is an Expert of Digital Ethics and Ethics of AI, as well as of the integration of EU values in digital technologies. On these topics she is involved in a number or research and technology transfer projects and serves as an ethics advisor for many international projects. She is also the President and a Co-Founder of GAIA srl, an innovative start up and university spin off focused on AI ethics and governance, and providing training and assessment of AI systems ethical impact and legal compliance. She has published seven books and more that 150 papers."
    }
  ]
}