{
  "title": "Introducing Graduate and Undergraduate Students to Research and Professional Ethics at Columbia University",
  "sections": [
    {
      "title": "Abstract",
      "content": "We have developed a several-hour long seminar that introduces students to the responsible conduct of research and ethics of professionalism. A broad spectrum of key issues in ethics is presented using recent reports of real ethical lapses and humorous examples from the public culture, followed by group discussions drawn from an extensive series of mini case scenarios developed by the author that are continually updated."
    },
    {
      "title": "NTRODUCTION",
      "content": "While many agree that responsible conduct in research and professionalism, collectively termed ethics here, are important , formal required training in ethics in academic graduate and undergraduate programs in the physical sciences and engineering is not widespread. The need for such required training is becoming increasingly recognized, and it has been instituted in some other types of programs, such as those in medical schools. Moreover, several government-funding agencies now require universities receiving grants to ensure that the investigators undergo some (often unspecified) form of ethics training; such university training commonly takes the form of standardized on-line courses and examinations.\nThe general lack of term-long required courses on ethics may be because they add to the already-heavy burden of coursework for undergraduate and graduate training, potential student resistance to spending much time on a subject they think will not advance their careers, and faculty disinterest or resistance. Sometimes such training might be included as a component of a required course . Other less extensive training options, such as multi-day or multi-week workshops, may offer some training, but again they are not widely offered or required. At Columbia University, we have developed a seminar for applied physics, applied mathematics, and materials science and engineering doctoral students and applied physics undergraduate students that explores the responsible conduct of research and ethics of professionalism; it has been presented over a dozen times, each time to ~20-40 students. This more-limited approach, two hours per seminar, addresses many of the goals of more extensive ethics training, and can be a practical substitute for the latter when the latter is not feasible for whatever the reason. A broad spectrum of key issues in ethics can still be raised, along with how to address them. One goal is to stimulate students to start thinking about ethics and cause some to start worrying if they consider transgressing (and to become more aware when they are transgressing-and such awareness can sometimes be a cultural issue). Key in the seminar is the presentation of reports of very recent real ethical lapses and humorous examples of such lapses found in the public culture, followed by group discussions drawn from an extensive series of mini case scenarios developed by the author that are continually updated. This seminar approach can be easily modified to target specific student audiences, including use during graduate student orientation.\nDiscussion of simulated cases is a cornerstone of day-long and longer ethics workshops; such discussions are thought to provide ethics education in an effective manner . In such workshops, the larger group sometimes divides into smaller sections, with each section tackling different case scenarios, scenarios that commonly branch into several directions that illustrate the potential complexities of solutions; each section then reports its conclusions to the larger group. In our approach, after a brief overview of ethics our group instead collectively discusses a series of simpler mini case scenarios. This enables consideration of a broad series of ethical situations in an interactive manner in a relatively short time. While not rigorously comprehensive, discussion topics are chosen to represent diverse classes of issues, such as those concerning plagiarism, data collection, authorship, and so on. As with interactions in longer workshops, this interactive approach, and the examples from public culture, engages and interests students more than straightforward, dry lectures, and provides training in evaluating and handling ethical issues.\nThe specific emphasis in our seminar is on responsible conduct of research and professionalism. There is a wide range of ethical situations in professional situations outside of the range of the purview of this seminar, for example, ethics in engineering (am I constructing a bridge or building that I know may not be safe because of budgetary constraints?), medicine (am I ignoring the results that the show deleterious side-effects of an otherwise-promising drug?), computer/privacy ethics, ethics in business, and so on. This approach can be straightforwardly modified to include society, industrial and medical ethics. The lessons learned during any ethics instruction activity will also prove useful to attendees who will have careers outside of research and development in the physical sciences and engineering."
    },
    {
      "title": "SEMINAR OVERVIEW",
      "content": "Our seminar has three components. It begins with a very brief presentation of several recent egregious public examples of ethical lapses, such as those related to plagiarism, publication retraction, cheating, data falsification, gaming college rankings, and so on. They provide an introduction to the seminar, motivation, and an illustration of the widespread and ever-changing landscape of ethical issues. These examples are continually updated using the plethora of new material that appears every year. Students taking this seminar several times over extended periods see new examples each time.\nIn the second part, the students are briefly introduced to the core issues in the responsible conduct of research, including data and research, authorship, content of papers and theses, and preparing and reviewing papers and proposals, and in professional ethics, including issues in employment, conflicts of interest, confidentiality, and resume accuracy, and to different ways of addressing them."
    },
    {
      "title": "everal basic points are raised in this section",
      "content": "There are some clear-cut issues and rules about what is right and wrong in research and in professional interactions. There is also much gray area. Knowing these rules is important. 3. When is an issue an ethical one? When is it just a mistake or misunderstanding or a legitimate difference in opinion? When is it sloppiness, which is itself unprofessional if it is deemed to be \"reckless\", or an honest mistake made by a careful person? How can biases in research be avoided (as illustrated by the historical references presented in )? When is an issue minor or trivial and when is it major and significant-and worth following up on? When is something a fraud or hoax, and when is the issue actually difficult scientific reproducibility? Is there just right and wrong, or is there a threshold for unethical or irresponsible behavior? When is an issue merely a matter of style or local convention? Sometimes the best response to such questions is a question asking for more details about the situation. 4. What is the threshold for pursuing a complaint, either in a formal or more casual manner? When is something really an ethical issue and when is it a \"power' issue between people in different positions (employer/employee, professor/student)? How do you resolve real ethical issues in light of a \"power\" asymmetry? Should you pursue a discussion (first and then later) with a peer, advisor, ombudsperson/conciliator, or a department chair? 5. There is also a big difference between being able to give the right (and often obvious) answer to an ethics-related question in an ethics training exam or at an ethics seminar and in recognizing and confronting a situation in the real world.\nThe words of physics legend Richard Feynman from \"Surely You're Joking, Mr. Feynman!\" are used to emphasize the importance of honesty in scientific research: \" … if you're doing an experiment, you should report everything that you think might make it invalid-not only what you think is right about it … If you make a theory, for example, and advertise it, or put it out, then you must also put down all the facts that disagree with it, as well as those that agree with it. … give all of the information to help others to judge the value of your contribution; not just the information that leads to judgment in one particular direction or another. ... We've learned from experience that the truth will come out. … And, although you may gain some temporary fame and excitement, you will not gain a good reputation as a scientist if you haven't tried to be very careful in this kind of work. …\" Some points are raised by presenting and then analyzing serious, real cases, such as the Jan Hendrik Schön case (which had great impact and is relatively recent, but is now unknown to many of our current students), and, to engage students better, also others from \"recent\" examples from (U.S.A.) mass media and culture in hopefully humorous ways. For example, scenarios from the plots of recent TV shows are reviewed, such as episodes from \"House\" and \"Bones\" that deal with the authorship and publication of manuscripts (in ridiculous and clearly unethical ways). The \"House\" episodes dealt with improper authorship, misuse of a colleague's notes, and exceedingly poor and ludicrous senior leadership , and the eventual conflict resolution among some of the concerned parties . The \"Bones\" episode described academic publishing in a very unrealistic manner, and was critiqued in detail in , including for suggesting that it was fine, and not a conflict of interest, for a supervisor to agree to review for a journal an independent manuscript submitted by her current lab assistant. A surprising episode in the less recent \"Leave it to Beaver\" is occasionally used. It involved the improper and surprising ghostwriting of a school assignment by a usually very upright parent that was so good that it was slated to receive an award, and this itself became a new issue . Advice on professional ethics addressed in popular ethics columns can be used to highlight an issue (such as the advice given on the confidentiality of evaluation letters in -with which the author disagrees). The (supposedly humorous) example of the famous Alpha-Beta-Gamma publication is presented along with its history (in which a scientist agreed to be added as the middle author to make the author list sound like Alpha-Beta-Gamma, at the suggestion of the true senior author and the apparent displeasure of the true junior author). Well-known song parodies can be presented. One example is the clever Tom Lehrer satire \"Lobachevsky\" on how to plagiarize . (Advice on the need to plagiarize to become a success is supposedly given by the great mathematician Nikolai Ivanovich Lobachevsky; of note, Lehrer explained that Lobachevsky's name was used for prosodic reasons and was not intended to slur the character of the renowned mathematician . The decision to use the name of a real scientist of presumably high character could itself be the topic of an ethics discussion.)\nThe third part of the seminar is an extended give-and-take discussion with students. This is by far the longest part (lasting most of a two-hour long seminar) and is very likely the most productive part of the seminar. Discussions are inspired by selecting several of the author's (currently) >200 one-sentence, mini case scenarios (along with >100 variations of these), that span the range of ethics covered by the seminar. They are fictionalized versions of the examples noted above, wellknown public cases, from the author's experience, and published case histories based on real events or fictionalized cases constructed for instruction. For example, the documentation of the Schön case in provided the inspiration for several case synopses. Although most of the situations described are uncommon, some are more common than commonly thought. Surprisingly, many of the case synopses that seem to be the most egregious and unbelievable are based on reality. When directly based on public sources (publically known events and published ethics literature), the sources are cited; those that are based on information the author has seen or heard from colleagues confidentially are not cited. Historical and fictionalized examples of misconduct by both junior and senior scientists are presented. Also, increasingly important areas in ethics, including the use of open and web resources and intellectual property, are topics for discussion.\nEach mini case scenario is presented on a slide for discussion. A series of slides is prepared, with backup slides, to cover a broad range of ethical situations planned for the seminar discussion. The seminar leader can help explore issues more deeply, including ways of resolving problems. Sometimes, the seminar leader can add details that could make resolving the case easier or more difficult, or could totally change opinions about the case. In the author's experience, there has been general agreement of what is right and wrong among the seminar attendees and seminar leader for most examples. It is the discussion of the relevant and related issues and their consequences that is at the core of the seminar. There has been some disagreement among seminar attendees (and the seminar leader) in very specific areas, such the responsibilities of prospective employees and employers (see below).\nVariations in the theme of several mini case scenarios are presented that either successively add new degrees of complexity to the situation or present slightly altered sets of circumstances (including reversing the roles of the main players). They can be presented sequentially during discussion. Some are easily resolved. Mini case scenarios can be combined to increase the complexity of the situation and the difficulty of clear resolution. During the seminar, the leader can change the presented questions, their order, and their complexity depending on the course of discussion.\nWhen presented to Columbia graduate students annually (who take it at the end of their first and second years-they usually start research full time after the coursework of the first year), different case synopses covering different ranges of material are presented in alternate years, along with updated recent examples of ethical lapses."
    },
    {
      "title": "MINI CASE SCENARIOS",
      "content": "These case synopses are presented in a very concise matter (in one, sometimes long sentence). They are listed in several broad categories, clustered within general sections; the themes of some synopses span more than one category. Some of the cited cases come from, and are presented in more detail and with more complexity, in ; other sources are used, such as those that continually update reported ethics violations and the retraction of papers for ethical (and other) reasons . In each synopsis, the \"he/she\" in \"What should he/she do?\" refers to the subject at the beginning of the prior sentence. Masculine and feminine pronouns are used in alternating sections in the listing, and are presented that way here.\nSelected examples of the mini case scenarios are provided here. A complete and continually updated compilation can be found at . Those that are presented with a reference are based on or have been stimulated by information provided in that reference, but with circumstances that may differ substantially from those presented there.\nData and Research (Scientific reproducibility): A graduate student is told to reproduce the experiment done by a graduated student as preliminary work for a more advanced experiment, and repeatedly cannot reproduce it, and tells the professor, who then becomes very annoyed . What should he do? Data and Research (Raw data): A graduate student is shocked when her advisor wants to see the raw (primary) data, and not secondary data (that had been imported into a data processing code) and wonders whether she is being trusted . What should she do? Authorship (Rights of authors): A professor notices the on-line publication of a paper by a former student (with the professor listed as an author), but was never even informed by the student that a paper was being prepared or submitted. What should he do? Content of Papers (Mode of presentation): A scientist has micrographs of samples that are central to the analysis in the paper but that do not look very convincing, so she wonders if it would be okay to present idealized diagrams of them in the main text and show the real micrographs only in the supplemental information, which is officially considered part of the paper. What should she do?\nReviewing Papers (Data and publications): A scientist is asked to review two manuscripts submitted for publication to two different journals at approximately the same time from two different groups at the same institution, that present exactly the same raw data and similar, but not identical analysis. What should he do? Professionalism (Confidentiality): While conducting a faculty search, a faculty member sees a confidential recommendation letter for an applicant who is a former student that is uncomplimentary, and thinks it would not be divulging a confidence by suggesting to that former student not to use that letter writer again, because she would not be saying explicitly that the letter was uncomplimentary . What should she do? Professionalism (Employment): A graduate student finishing his thesis applied for employment with companies A and B, receives and then accepts the offer from company A, later receives an offer from company B-which he prefers-and wonders whether it would be proper to then rescind his acceptance to company A and accept the offer from company B. What should he do? (There has usually been disagreement, and extensive discussion, between the author (and seminar leader) and the seminar participants for this case scenario, with the leader favoring honoring the first commitment and many students favoring choosing the superior job. This may reflect a generational shift, which might be explained by the changes in how employers are viewed in dealing with employees and the current state of the job market.) Professionalism (Resumes): A scientist applying for a job in industry wants to make sure her resume puts her in the best possible light and wonders whether it would be okay to tweak her resume by listing her undergraduate minor as being materials science and engineering-which would make the application stronger, instead of what it was officially, materials science. What should she do?\nThis compilation can also be used for self-study, to expose the student to a fuller range of potential ethical situations and how to think about them."
    },
    {
      "title": "CONCLUDING REMARKS",
      "content": "Applied physics, applied mathematics, and materials science and engineering doctoral students are required to participate in this two-hour seminar twice, once during each of their first two years. Different sets of case synopses are explored in consecutive years so the direction of the discussion is different in both years of student participation; the set of real cases is also changed (and updated) each year. Applied physics undergraduates participate in a somewhat shortened version of this seminar in either their junior or senior year, as one component of the required junior and senior year course: Seminar: Problems in Applied Physics. This approach can be easily adapted to shorter and longer seminar periods, and for a series of weekly two-hour seminars, and to other disciplines.\nCopies of a recent seminar presentation and set of mini case scenarios are available from the author on his website . The author intends to continue to extend the series of mini case scenarios collection to make it more comprehensive and up-todate."
    }
  ]
}